{
  "quantum": "As a forensic equity options analyst specializing in dealer positioning and market maker hedging dynamics, the following landscape reflects the current gamma distribution and structural barriers for the active (Jan 30, 2026) expiration:\n\n**IONQ:50.00,47.00,45.00,47.00,51.00-55.00,41.00-44.00;**\nDealers are currently net long gamma above the $47.00 pivot, which acts as the volatility dampener. The $50.00 Call Wall presents a significant upside friction point where market makers must sell shares to remain delta neutral, while the $45.00 Put Wall provides a structural hard floor where hedging shifts to aggressive buying. Gamma voids exist in the strike gaps above $51.00 and below $44.00, where liquidity thinning could accelerate moves.\n\n**QBTS:30.00,25.00,24.00,25.50,31.00-35.00,16.00-23.00;**\nD-Wave's landscape is heavily call-skewed with a massive $30.00 Call Wall. The $25.00 pivot serves as the gamma flip; remaining above this strike encourages price pinning toward the $25.50 Max Pain. A breach below $24.00 enters a \"short gamma\" regime where dealers sell into weakness, potentially targeting the downside void levels near $20.00.\n\n**RGTI:33.00,23.00,21.00,23.50,34.00-40.00,15.00-20.00;**\nRigetti exhibits a dominant upside barrier at $33.00. Market makers are currently focused on the $23.00-$24.00 range, with the Gamma Flip at $23.00 acting as the break point for increased volatility. The downside Put Wall at $21.00 represents the dealer's terminal hedging limit for this weekly cycle.\n\n**QUBT:13.00,11.50,11.00,11.50,14.00-18.00,6.00-10.00;**\nQuantum Computing Inc. shows tight pinning around the $11.50 Max Pain. The $13.00 Call Wall is the primary overhead resistance, while the $11.00 Put Wall offers immediate support. A break of $11.00 could trigger a rapid move through the downside gamma void toward the $9.00 level.\n\n**LAES:5.00,4.50,4.50,4.50,6.00-8.00,2.00-4.00;**\nSEALSQ is characterized by a \"gamma squeeze\" profile at $5.00, which serves as the Call Wall. The $4.50 strike is a confluence point for the Gamma Flip, Put Wall, and Max Pain, suggesting a high probability of price pinning. Outside of the $4.50-$5.50 range, the lack of open interest creates substantial gamma voids.\n\n**ARQQ:30.00,25.00,20.00,25.00,31.00-40.00,15.00-19.00;**\nArqit's positioning is widest among the peer group, with the Call Wall at $30.00 and Put Wall at $20.00. The Gamma Flip is centered at $25.00; as long as the spot price remains above $25.00, dealers are in a \"buy the dip\" hedging posture, while a drop below $25.00 introduces significant downside risk toward the $20.00 floor."
}