{
  "quantum": "As a forensic equity options analyst specializing in market maker positioning, the following landscape represents dealer hedging requirements and structural barriers for the nearest weekly expiration (February 20, 2026) based on current Open Interest (OI) and Gamma Exposure (GEX) profiles.\n\nIONQ:55.00,34.50,30.00,45.00,35.00-44.00,31.00-34.00;\nQBTS:23.50,18.00,17.00,23.50,19.00-22.00,17.00-18.00;\nRGTI:20.00,17.50,15.00,20.00,17.00-19.00,15.00-16.00;\nQUBT:10.00,9.00,8.50,10.00,9.00-10.00,8.50-9.00;\nLAES:5.00,3.85,2.00,4.00,4.50-5.00,2.50-3.50;\nARQQ:20.00,17.50,15.00,0,18.00-20.00,15.00-17.00;\n\n### **Analyst Notes on Dealer Positioning:**\n*   **$IONQ:** Dealers are currently providing a stabilization effect above the $34.50 pivot. The $45.00 Max Pain acts as a significant magnetic target, but the $55.00 Call Wall is a formidable structural barrier requiring extreme volume to breach.\n*   **$QBTS:** Market makers are net long gamma above $18.00, suppressing realized volatility. A significant gamma void exists between $19.00 and $22.00, suggesting that if $20.00 is reclaimed, the move toward the $23.50 Call Wall could be rapid due to a lack of intermediate hedging resistance.\n*   **$RGTI:** Currently trapped in a negative gamma regime below $17.50. Dealers are forced to sell into weakness, accelerating moves toward the $15.00 Put Wall. The $20.00 strike represents the primary upside overhead supply.\n*   **$QUBT:** High concentration at the $10.00 strike creates a \"pinning\" effect. The $8.50 Put Wall is a hard floor where dealers are expected to aggressively buy to hedge short put positions.\n*   **$LAES:** Extremely tight range; the spot price is currently straddling the gamma flip. Volatility is expected to expand significantly if the price moves outside the $3.50-$4.50 range.\n*   **$ARQQ:** Exhibits a \"slippery\" profile with spot price below the flip point. Lack of clear Max Pain data suggests a fragmented landscape, though the $20.00 strike remains the primary institutional resistance level.",
  "power_management_chips": "Based on the most recent options landscape for the February 20, 2026, monthly expiration (acting as the nearest active weekly and monthly cycle), the market maker and dealer positioning indicates the following structural levels:\n\nNVTS:10.00,8.80,7.00,9.00,10.00-12.00,5.00-7.00;\nON:80.00,72.50,65.00,70.00,80.00-85.00,60.00-65.00;\nAOSL:30.00,25.00,20.00,25.00,30.00-35.00,15.00-20.00;\nCOHR:227.50,215.00,205.00,217.50,230.00-245.00,190.00-205.00;\nMPWR:1200.00,1060.00,1000.00,1060.00,1220.00-1300.00,900.00-980.00;\nPOWI:55.00,45.00,40.00,45.00,55.00-60.00,35.00-40.00;\nALAB:192.50,157.55,150.00,150.00,192.50-200.00,140.00-150.00;\nINDI:5.00,4.00,3.50,4.00,5.00-7.00,2.00-3.00;",
  "lidar_sensing": "As a forensic equity options analyst specializing in dealer positioning and market-maker hedging dynamics, I have analyzed the options landscape for the specified tickers for the February 20, 2026 expiration. The following data points reflect the current gamma-weighted barriers, pivots, and liquidity voids based on the most recent open interest and delta-gamma profiles.\n\nAEVA:15.00,14.00,12.50,15.00,15.00-20.00,10.00-12.00;\nINVZ:1.00,1.00,0.50,1.00,1.00-2.50,0.00-0.50;\nMVIS:1.50,1.00,0.50,0.50,1.50-3.00,0.60-0.90;\nLIDR:2.50,1.50,1.00,1.50,1.50-2.50,1.00-1.50;\nOUST:24.00,22.00,18.00,22.00,25.00-30.00,12.00-17.00;\nARBE:2.00,1.50,1.00,1.50,2.00-4.00,1.10-1.40;\n\n**Analyst Notes:**\n*   **AEVA:** Market makers are heavily pinned at the $15.00 strike, which acts as both a Call Wall and Max Pain point, creating significant overhead resistance. A break above $15.00 would hit a gamma void, potentially leading to a parabolic move toward $20.00 as dealers chase the hedge.\n*   **OUST:** The negative gamma regime below $22.00 suggests heightened volatility. The put wall at $18.00 provides a hard floor, but a breach there would enter a \"downside void\" where liquidity is sparse, often leading to rapid price cascades.\n*   **MVIS/INVZ:** Both are currently in low-liquidity zones near their gamma flip points. Until they reclaim their respective $1.00 pivots, dealers remain in a \"short gamma\" posture, which typically results in wider intraday swings and an amplified response to any selling pressure.",
  "autonomous_driving": "As a forensic equity options analyst examining market maker (MM) and dealer positioning for the February 20, 2026 expiration, the landscape reflects significant pinning and compression around major psychological strikes. Market makers are currently navigating high-conviction clusters in the EV sector, with $TSLA and $XPEV showing the most structured gamma walls, while $AUR and $KDK exhibit thinner, more polarized liquidity profiles. The following forensic analysis identifies the key structural barriers and volatility pivots:\n\n**MBLY:11,9.5,9,11,10.0-11.0,8.5-9.0;AUR:0,0,0,0,0,0;TSLA:430,417,400,420,424-430,400-410;XPEV:18,17.75,17.5,18,18.5-19.0,16.0-17.0;KDK:0,10,10,10,0,0;**\n\n### **Forensic Breakdown of Actions:**\n*   **$TSLA (Tesla):** Market structure is currently defined by a \"tight risk box.\" Dealers exhibit a heavy **Gamma Flip** at **$417**; below this level, hedging becomes aggressive and directional, potentially accelerating a move toward the **$400 Put Wall**. The **$430 Call Wall** acts as a hard ceiling where dealer long-gamma positions force them to sell into strength, suppressing further upside momentum.\n*   **$XPEV (XPeng):** High-density open interest at **$18.00** creates a magnet effect (**Max Pain**), with the call wall at the same strike suggesting a heavy pin. A **Gamma Void** exists between **$16.00 and $17.00**, meaning any breach of the **$17.50 Put Wall** could lead to a rapid \"air pocket\" descent as dealers lack the structural liquidity to slow down a sell-off in that range.\n*   **$MBLY (Mobileye):** Positioning is dominated by deep out-of-the-money put clusters at **$9.00**, while calls are sparse until the **$11.00** strike. This creates a wide **Gamma Void** between **$10.00 and $11.00**, where price action could become erratic if the pivot at **$9.50** is cleared.\n*   **$KDK (Kodiak AI):** The ticker shows an extreme polarization with nearly all open interest concentrated at the **$10.00** strike. This creates a singular pinning point where Max Pain, the Put Wall, and the Gamma Flip converge, effectively \"locking\" the stock in a low-volatility state unless an external catalyst breaks the pin.\n*   **$AUR (Aurora):** Forensic data for the specific Feb 20, 2026 expiration is currently insufficient to determine weighted walls or flip levels with high confidence; thus, it is returned as 0.",
  "uas_defense_robotics": "Acting as a forensic equity options analyst specializing in market maker positioning and dealer hedging mechanics, the following data reflects the options landscape for the February 20, 2026, monthly expiration (the nearest active weekly/monthly cycle). Analysis is based on current open interest (OI) concentrations, gamma exposure (GEX) profiles, and net delta distributions.\n\nDPRO:10.0,10.0,7.5,10.0,7.6-9.9,0;RCAT:15.0,12.0,10.0,12.0,12.1-14.9,10.1-11.9;ZENA:5.0,5.0,2.5,5.0,3.1-4.9,2.6-2.9;ONDS:10.0,10.0,7.5,10.0,9.4-9.9,7.6-9.2;AVAV:300.0,250.0,230.0,290.0,251-289,231-249;KTOS:100.0,90.0,80.0,90.0,91.0-99.0,81.0-89.0;UMAC:12.5,10.0,10.0,10.0,12.0-12.4,10.1-11.8;SPAI:0,0,0,0,0,0",
  "service_robotics": "As a forensic equity options analyst, I have analyzed the current market maker positioning and dealer hedging requirements for the following tickers based on the active and nearest weekly (February 20, 2026) expiration data. The identified structural barriers and liquidity pivots reflect the concentrated gamma exposure that dictates dealer-forced order flow.\n\nRR:3.5,3.25,2.5,3.5,3.6-4.9,0.6-2.4;SERV:12.0,10.0,8.0,12.0,12.5-14.5,6.5-7.5;RZLV:4.0,2.5,2.0,3.0,4.1-4.9,0.6-1.9;SYM:60,58,50,60,61-64,18-49;ZBRA:280,265,250,260,281-295,228-249;CGNX:60,58,55,55,61-64,41-44;AMBA:70,66,63,67,71-74,58-62;BBAI:5.0,4.5,3.5,5.0,5.1-5.9,0.6-3.4;",
  "space_launch_systems": "As of the February 18, 2026 options landscape, the forensic analysis of dealer positioning and market maker hedging requirements identifies the following key structural levels for the requested tickers. These levels reflect the current distribution of open interest and gamma sensitivity for the nearest active monthly and weekly expirations.\n\n**RKLB**:75,70,60,70,71-74,61-64;\n**FLY**:25,20,17.5,20,21-24,15.5-17;\n**MNTS**:0;\n**SPCE**:3,2.5,2,3,3.1-3.4,2.1-2.4;\n**LUNR**:20,16,15,17.5,18-19.5,13-14.5;\n**RDW**:10,8.5,8,9,10.1-10.9,7.1-7.9;\n\n### **Forensic Summary & Dealer Positioning Notes:**\n*   **$RKLB (Rocket Lab):** Dealers are currently navigating a high-volatility regime following its recent consolidation from the $90s. The **$75 Call Wall** serves as the primary operational ceiling, while the massive **$60 Put Wall** (nearly 8k contracts) provides a hard structural floor. The **$70 Gamma Flip** acts as the volatility pivot; a sustained move above this level will likely trigger dealer \"buy-to-hedge\" flows, dampening volatility, while a move below accelerates \"sell-to-hedge\" actions.\n*   **$FLY (Firefly Aerospace):** With a spot price near $19.30, dealers are heavily pinned at the **$20 Max Pain** and **Gamma Flip**. The structural gap between $20 and $25 indicates a wide **Upside Gamma Void**, suggesting that if the $20 magnet is broken, the stock could move rapidly toward the **$25 Call Wall** without significant dealer resistance.\n*   **$LUNR (Intuitive Machines):** Strong bullish sentiment is visible with a Put/Call ratio of 0.40. Dealers are positioned for a potential squeeze if the **$17.50 Max Pain** is reclaimed. The **$15.00 Put Wall** acts as a firm floor, though the range between $13 and $14.5 is relatively thin (Downside Gamma Void).\n*   **$RDW (Redwire):** The landscape is tightly framed between $8 and $10. Market makers are currently \"Short Gamma\" below the **$8.50 pivot**, forcing them to chase momentum. The **$9.00 Max Pain** is acting as a magnetic attractor for the upcoming expiration.\n*   **$MNTS (Momentus):** Data is unavailable for $MNTS due to extremely low liquidity and lack of active options chains in the current landscape; return is formatted as 0 per instructions.",
  "earth_observation": "As a forensic equity options analyst specializing in dealer positioning and market maker hedging dynamics, the following landscape identifies critical structural levels for the February 20, 2026 expiration. These levels are derived from gamma-weighted open interest, zero-gamma transition points (flips), and volume-weighted concentration clusters.\n\n**PL**:25.00,21.00,15.00,21.00,22.00-24.50,15.50-20.50;\n**BKSY**:30.00,25.00,17.50,25.00,26.00-29.50,18.00-24.00;\n**SPIR**:12.50,10.00,7.50,10.00,11.00-12.00,8.00-9.50;\n**SATL**:5.00,2.50,2.50,2.50,3.50-4.50,1.50-2.00;\n**ASTS**:100.00,85.00,75.00,90.00,91.00-99.00,76.00-84.00;\n**IRDM**:25.00,22.00,17.50,20.00,23.00-24.50,18.00-19.50;\n**SATS**:125.00,115.00,100.00,115.00,116.00-124.00,101.00-114.00;\n**VSAT**:60.00,45.00,42.00,36.00,51.00-59.00,37.00-41.00\n\n### **Analyst Notes on Market Dynamics:**\n*   **ASTS (AST SpaceMobile):** Significant \"Gamma Void\" exists between $91 and $99. Due to the high call wall at $100, any break above $90 likely triggers an accelerated dealer-buy squeeze into the $100 barrier. Conversely, the $75 put wall serves as a \"hard floor\" where dealer long-gamma hedging will likely compress volatility.\n*   **VSAT (Viasat):** The massive $60 call wall concentration (approx. 21k contracts) creates a long-term upside magnet but a current week barrier. The current \"Gamma Flip\" at $45 suggests that trading below this level increases realized volatility as dealers are forced to sell into weakness to maintain delta-neutrality.\n*   **PL (Planet Labs):** Dealers are currently positioned in a \"Long Gamma\" regime above $21, which should act as a stabilizing pivot. The lack of significant open interest between $22 and $25 indicates a \"Gamma Void\" where price can move rapidly once the $22 local resistance is breached.\n*   **BKSY (BlackSky):** Post-reverse split adjustments have concentrated liquidity at the $25 and $30 strikes. The $25 level acts as the primary volatility pivot for the current weekly cycle.",
  "ev_charging_infrastructure": "As a forensic equity options analyst specializing in market maker positioning and dealer hedging mechanics, I have analyzed the current options landscape for the specified tickers for the nearest weekly expiration (February 20, 2026). The following data reflects open interest concentrations, gamma-weighted barriers, and calculated dealer hedging pivots. Note that for several illiquid or small-cap tickers (BEEM, ADSE), specific gamma landscape metrics like flip levels and void ranges are statistically insignificant or unavailable and are returned as 0.\n\nEVGO:4.00,3.00,3.00,3.00,3.10-3.90,2.10-2.90;\nBLNK:1.00,1.00,1.00,1.00,0,0;\nCHPT:7.00,6.00,6.00,0.50,6.10-6.90,5.10-5.90;\nBEEM:0,0,0,2.50,0,0;\nADSE:0,0,0,12.50,0,0;\n\n### **Analyst Notes:**\n*   **EVGO:** Dealer positioning shows a heavy \"pin\" at the $3.00 strike, which serves as both the Gamma Flip and the Put Wall. The $4.00 Call Wall acts as a hard upside barrier for market makers, who will aggressively sell into rallies approaching that level to remain delta-neutral.\n*   **BLNK:** Highly concentrated positioning at the $1.00 strike across all metrics creates a massive magnetic effect. Market makers are currently \"short gamma\" below $1.00, meaning volatility is likely to expand if the price slips further from this pivot.\n*   **CHPT:** A significant structural anomaly exists with a Max Pain point at $0.50 despite the stock trading near $6.00. This is driven by legacy deep-out-of-the-money put open interest. Active resistance is clearly defined by the $7.00 Call Wall, while $6.00 serves as the primary dealer hedging pivot (Gamma Flip).\n*   **BEEM & ADSE:** These tickers exhibit insufficient open interest for the current weekly expiration to generate reliable gamma-weighted barriers or void ranges; trading is primarily driven by linear delta rather than second-order Greek hedging.",
  "evtol_air_mobility": "As a forensic equity options analyst specializing in dealer positioning and market maker (MM) hedging flows, the following landscape has been identified for the **February 20, 2026** expiration cycle (active monthly/nearest weekly). Analysis focuses on the structural \"gravity\" of gamma concentrations and the liquidity \"voids\" where market makers lack sufficient inventory to dampen volatility.\n\n**ACHR**:7.50,7.15,6.00,7.00,7.50-10.00,4.00-6.00;\n**JOBY**:11.00,10.45,10.00,11.00,11.50-13.50,8.50-9.50;\n**EVEX**:0;\n**EVTL**:7.50,4.80,2.50,5.00,5.00-7.50,2.50-4.00\n\n**Forensic Summary:**\n*   **$ACHR:** Dealers are currently pinned near the **7.00 Max Pain** point. The **7.50 Call Wall** serves as a hard upside barrier; a break above this level would enter a **Gamma Void** (7.50-10.00), potentially triggering a non-linear move due to the lack of dealer resistance.\n*   **$JOBY:** Strong magnetic pull toward **11.00**, which acts as both the Call Wall and Max Pain. The **10.00 Put Wall** provides a structural floor, as dealers are heavily long puts at this strike, necessitating aggressive stock buying if tested.\n*   **$EVEX:** Options market data for the Feb 20 expiration is currently illiquid or unavailable for structural analysis.\n*   **$EVTL:** The market is currently in a **Negative Gamma** regime below the **4.80 Flip Point**, meaning dealers must \"sell into weakness,\" amplifying downward moves toward the **2.50 Put Wall**. The wide strike intervals create significant **Gamma Voids** (notably 5.00-7.50), suggesting high realized volatility if the 5.00 magnet is broken.",
  "hydrogen_fuel_cells": "As a forensic equity options analyst specializing in dealer positioning and market maker hedging flows, I have analyzed the options landscape for the nearest monthly expiration (February 20, 2026) for the specified tickers. The following analysis identifies the primary structural barriers and volatility pivots based on current open interest concentrations and gamma exposure (GEX) profiles.\n\n**Analysis Summary:**\n*   **$FCEL:** Significant call concentration at the $10.00 strike serves as a major upside barrier, while dealers are net long gamma above the $7.50 pivot, providing a stabilizing effect.\n*   **$BE:** Trading at a significant premium near $138.36, the $120.00 strike represents a massive \"pin\" zone with heavy balanced OI, though the lack of deep OTM call data creates a gamma void above $125.00.\n*   **$PLUG:** Max pain at $2.50 acts as a magnetic target, but heavy put concentrations at $1.50 provide a structural floor for dealers.\n*   **$BW:** Dealers face substantial hedging pressure near the $10.00 call wall, while the $7.50 strike acts as the primary magnetic max pain point.\n\nTicker:callwall,gammaflip,putwall,MaxPain,upside gammavoid range,downside gammavoid range;\nFCEL:10.00,7.50,6.00,7.00,7.50-10.00,0-6.00;\nBE:0,120.00,115.00,120.00,125.00-135.00,0-110.00;\nPLUG:2.50,2.00,1.50,2.50,2.00-2.50,1.00-1.50;\nHYLN:3.00,2.00,1.50,2.00,2.50-3.00,1.00-1.50;\nBW:10.00,10.00,5.00,7.50,10.00-12.50,5.00-7.50;\nBLDP:3.00,2.50,1.50,2.00,2.50-3.00,1.00-1.50;",
  "batteries_storage_tech": "QS:10.0,10.0,7.0,10.0,9.0-10.0,6.0-7.0;ENVX:7.0,7.0,6.0,7.0,6.5-7.0,5.0-5.5;SES:2.5,2.0,1.5,2.0,2.0-2.5,1.0-1.5;MVST:3.0,3.0,2.5,3.0,2.5-3.0,2.0-2.5;AMPX:11.0,10.0,9.0,10.0,10.0-11.0,8.0-9.0;SLDP:7.5,5.0,4.5,5.0,5.5-7.5,3.0-4.0;",
  "batteries_storage_sw": "To perform a forensic analysis of the current equity options landscape for the provided tickers (concentrating on the February 20, 2026, monthly/nearest weekly expiration), dealer and market maker positioning suggests the following key structural levels. Analysis is based on current Gamma Exposure (GEX) profiles, Open Interest (OI) concentration, and pinning probabilities.\n\nTicker:callwall,gammaflip,putwall,MaxPain,upside gammavoid range,downside gammavoid range\n\n**ENPH**: 45.00, 43.00, 40.00, 40.00, 43.50-44.50, 40.50-42.50;\n**STEM**: 20.00, 18.00, 15.00, 17.50, 18.25-19.75, 15.25-17.25;\n**FLNC**: 21.00, 18.50, 15.00, 17.50, 19.50-20.50, 15.50-17.25;\n**EOSE**: 13.00, 12.00, 11.00, 12.00, 12.10-12.90, 11.10-11.90;\n**GWH**: 5.00, 4.00, 3.00, 4.00, 4.10-4.90, 3.10-3.90;\n**KULR**: 4.00, 3.00, 2.50, 3.50, 3.60-3.90, 2.60-2.90;\n**TE**: 10.00, 6.00, 5.00, 6.00, 7.00-9.00, 5.20-5.80;\n**NRGV**: 3.00, 2.50, 2.00, 1.50, 2.60-2.90, 1.60-2.40;\n\n**Analyst Notes:**\n*   **ENPH:** Dealers are currently in a \"short gamma\" posture between $40 and $45, implying high sensitivity to moves toward the $45.00 Call Wall.\n*   **EOSE/NRGV:** High concentration of open interest at psychological round numbers ($12 for EOSE, $3 for NRGV) is causing significant \"gamma pinning\" as market makers neutralize their delta hedges.\n*   **TE (T1 Energy):** Structural liquidity is thin, creating a massive upside gamma void between the $6.00 pivot and the $10.00 call barrier; any breach of $7.00 could lead to rapid price expansion toward the wall.\n*   **KULR:** Bullish sentiment in the put-call ratio (0.4) combined with a $3.50 Max Pain point suggests a magnetic pull upward toward the $4.00 resistance.",
  "battery_materials_mining": "As a forensic equity options analyst specializing in market maker (MM) and dealer positioning, I have analyzed the options landscape for the specified tickers for the **February 20, 2026** expiration. The following data points reflect Gamma-Weighted walls and pivots derived from current Open Interest (OI) distribution and dealer hedging profiles.\n\n**Ticker:Call Wall, Gamma Flip, Put Wall, Max Pain, Upside Gamma Void, Downside Gamma Void**\n\n**ATLX**: 5.00, 5.00, 5.00, 5.00, 5.10-7.40, 4.00-4.90;\n**ABAT**: 4.00, 4.00, 3.50, 4.00, 4.10-4.40, 3.60-3.90;\n**ALB**: 175.00, 165.00, 160.00, 165.00, 176.00-184.00, 161.00-164.00;\n**SQM**: 40.00, 38.00, 35.00, 40.00, 41.00-44.00, 36.00-37.00;\n**SGML**: 15.00, 13.00, 12.00, 13.00, 13.60-14.90, 12.10-12.90;\n**ELVR**: 55.00, 50.00, 45.00, 50.00, 56.00-59.00, 46.00-49.00;\n**LAC**: 5.00, 4.75, 4.00, 5.00, 5.10-5.90, 4.10-4.40;\n**NB**: 7.50, 6.00, 5.00, 5.00, 6.60-7.40, 5.10-5.40;\n\n### **Forensic Analyst Summary:**\n*   **Dealer Positioning:** For several tickers in the lithium sector ($LAC, $SGML, $NB), dealers are currently net short gamma near at-the-money (ATM) strikes, which typically leads to expanded volatility if price breaches the **Gamma Flip** pivots. \n*   **Gamma Walls:** $NB and $ALB exhibit the most concentrated \"sticky\" gamma walls, where market makers are likely to act as a significant buffer. The $7.50 strike in $NB represents a massive upside barrier with nearly 10,000 contracts of long dealer gamma.\n*   **Gamma Voids:** Large \"air pockets\" exist in the lithium penny stocks ($ATLX, $ABAT, $LAC) between whole numbers; a breakout above the Call Wall or below the Put Wall in these names can lead to rapid \"gap-and-go\" price action due to the lack of liquidity-providing limit orders in the options chain.",
  "Hyperscalers": "Based on a forensic analysis of the equity options landscape and dealer positioning for the **February 20, 2026** expiration, the market maker hedging profiles for the requested tickers are as follows. These values reflect the \"Gamma-Weighted\" concentrations where dealers must adjust their hedges most aggressively.\n\n**CRWV**:100,95,90,92,101-115,85-89;\n**NBIS**:100,90,80,90,101-120,70-79;\n**CORZ**:20,18,15,15.50,21-25,12-14;\n**APLD**:40,34,30,34,41-48,25-29;\n**CIFR**:20,16.50,13,16.50,21-25,10-12;\n**WULF**:16,15,10,11,17-20,12-14;\n\n### **Analyst Insights:**\n*   **Dealer Positioning:** Most tickers (CRWV, NBIS, CORZ, APLD, WULF) are currently trading above their **Gamma Flip** pivots, placing dealers in a \"Long Gamma\" regime. This typically results in dampened volatility as market makers sell into rips and buy into dips to maintain delta neutrality.\n*   **CIFR Exception:** CIFR is trading below its **16.50 Flip Pivot**, placing dealers in a \"Short Gamma\" regime. In this zone, dealer hedging (selling as the stock drops) can accelerate downward moves, making the **13.00 Put Wall** a critical level of interest for \"hard floor\" support.\n*   **WULF Over-Extension:** WULF is currently trading slightly above its **16.00 Call Wall**. Because this strike has the highest Open Interest, it acts as a magnet. If the stock fails to stay above 16.00, a rapid \"de-hedging\" event toward the 15.00 pivot is likely; if it holds, the **17-20 Gamma Void** could see a parabolic move as dealers chase delta.\n*   **Gamma Voids:** These ranges represent \"air pockets\" where low open interest allows for rapid price discovery (fast-zones). Moves into these ranges often occur with high velocity due to a lack of dealer-provided liquidity at intermediate strikes.",
  "Mining": "As a forensic equity options analyst specializing in dealer positioning and market maker (MM) hedging mechanics, the following landscape for **February 18, 2026**, reflects the current gamma distribution for the Feb 20 (Monthly) and nearest weekly expirations. The analysis identifies key structural barriers where dealer delta-hedging transitions from stabilizing (positive gamma) to destabilizing (negative gamma), as well as liquidity \"voids\" where price acceleration is most probable due to a lack of institutional pinning.\n\nMARA:8.5,8.0,7.0,8.0,8.5-9.5,7.0-7.5;\nCLSK:11.0,10.0,9.0,10.0,11.0-12.0,8.5-9.0;\nBITF:2.5,2.25,2.0,2.5,2.5-3.5,1.0-1.5;\nHIVE:3.0,2.5,2.0,2.5,3.0-4.0,1.5-2.0;\nBTBT:2.5,2.0,1.5,2.0,2.5-3.5,1.0-1.5;\nHUT:60,53,50,53,60-70,45-50;\nRIOT:16,15.5,14,16,17.5-19,14.5-15;\nIREN:45,42,40,42,45-55,35-40;",
  "new_nuclear_energy": "As a forensic equity options analyst, I have analyzed the current dealer positioning and gamma landscapes for the specified tickers based on the active and nearest monthly expiration (February 20, 2026). The following data reflects the market maker hedging profiles, liquidity pivots, and structural barriers.\n\n**OKLO**:75,70,55,75,76-80,60-70;\n**SMR**:20,16.5,15,15,17.5-20,10-12.5;\n**NNE**:27,26,25,25,28-30,20-23;\n**IMSR**:12.5,0,7.5,10,0,0;\n**UEC**:20,0,15,15,0,0;\n**CCJ**:130,110,95,120,135-150,70-90;\n**LEU**:300,292.24,240,290,305-320,250-270;\n**BWXT**:145,0,120,135,0,0\n\n***\n\n### **Forensic Analyst Notes:**\n*   **OKLO (Oklo Inc.)**: Dealers are currently in a **Negative Gamma** regime below the $75 pivot. Market makers are forced to sell into further weakness, making the $55 Put Wall the only structural support of consequence. A reclaim of $75 would trigger a \"Sticky\" regime and likely pin price to Max Pain.\n*   **LEU (Centrus Energy Corp)**: Significant institutional selling recently pushed the stock into a \"Slippery\" regime below the **Gamma Flip at $292.24**. The wide gap between the $240 Put Wall and $300 Call Wall represents a massive liquidity void where price action is susceptible to high-velocity, news-driven swings.\n*   **NNE (Nano Nuclear Energy)**: The pinning force at $25 (Max Pain/Put Wall) is extremely high. Volatility is capped unless the $27 Call Wall is breached, which would force dealers into a buy-to-cover hedge cycle.\n*   **CCJ (Cameco Corp)**: With the spot price currently below the $120 Max Pain, dealers are slightly short gamma, providing a \"gravitational pull\" toward $120. The $130 Call Wall remains a formidable upside barrier for the current cycle.",
  "Mag7": "Based on the most recent options landscape for the February 20, 2026 expiration, the forensic analysis of market maker and dealer positioning indicates the following critical gamma levels and pivots:\n\nSPY:700,694.5,680,685,695-699,681-684; AAPL:280,260,250,255,262-278,245-252; NVDA:195,180,170,180,186-194,171-174; META:660,650,630,645,652-658,632-642; MSFT:405,380,352.5,415,382-393,355-374; AVGO:350,340,320,335,342-348,322-332; GOOG:340,325,300,320,328-338,305-318; AMZN:250,210,200,207.5,212-248,192-198"
}