{
  "quantum": "Ticker:ionq,50.00,46.00,45.00,46.50,47.00-50.00,40.00-45.00; qbts,25.00,22.50,20.00,25.00,23.00-25.00,20.00-22.00; rgti,25.00,21.50,18.00,23.50,22.50-25.00,18.50-21.00; qubt,11.00,10.00,9.00,11.00,10.50-11.00,9.00-9.50; laes,5.00,4.50,4.00,5.00,4.50-5.00,4.00-4.50; arqq,0,0,0,0,0,0;",
  "power_management_chips": "Based on the most recent options landscape for the February 2026 expiration cycle and nearest weekly data (Feb 6, 2026), here is the forensic analysis of market maker and dealer positioning. \n\n**Ticker:callwall,gammaflip,putwall,MaxPain,upside gammavoid range,downside gammavoid range;**\n\n**NVTS**:10.00,9.00,9.00,9.50,9.50-10.00,0-7.50; \n**ON**:70.00,60.00,56.00,60.00,65.00-70.00,0-55.00; \n**AOSL**:27.50,22.50,20.00,22.50,25.00-27.50,0-20.00; \n**COHR**:200.00,197.50,190.00,197.50,200.00-210.00,0-190.00; \n**MPWR**:1200,1100,1000,940,1150-1200,0-1000; \n**POWI**:55.00,47.50,45.00,50.00,50.00-55.00,0-45.00; \n**ALAB**:160.00,167.50,147.00,167.50,160.00-165.00,0-145.00; \n**INDI**:5.00,4.50,4.00,4.00,4.50-5.00,0-4.00;\n\n**Forensic Analyst's Note:** \n*   **$COHR** and **$NVTS** show high \"sticky\" gamma at their respective call walls ($200 and $10), suggesting significant resistance and potential for price pinning. \n*   **$ALAB** displays an unusual inversion where Max Pain is significantly above the primary Call Wall for the Feb 6 weekly, indicating a massive gamma void between $160 and $175 where dealer hedging may become \"slippery\" if the $160 level is breached.\n*   **$MPWR** and **$INDI** results are weighted toward the February monthly (Feb 20) due to higher liquidity and more reliable dealer positioning signals compared to thin weekly chains. \n*   **$ON** and **$POWI** are currently positioned in \"Short Gamma\" regimes below their volatility pivots, suggesting higher realized volatility as dealers are forced to sell into weakness and buy into strength to maintain delta neutrality.",
  "lidar_sensing": "As a forensic equity options analyst specializing in dealer positioning and market maker hedging, I have analyzed the current options landscape for the requested Lidar sector tickers based on the active February 20, 2026, monthly cycle and the nearest weekly (February 6, 2026) where applicable.\n\n**AEVA**:20.00,15.00,12.50,15.00,17.50-20.00,10.00-12.50;\n**INVZ**:1.50,1.00,1.00,1.50,1.50-2.00,0.50-1.00;\n**MVIS**:1.00,1.00,1.00,1.00,1.00-1.50,0.50-1.00;\n**LIDR**:0,0,0,0,0,0;\n**OUST**:25.00,21.00,20.00,25.00,21.00-24.00,19.00-20.00;\n**ARBE**:2.00,1.50,1.50,1.50,2.00-3.00,1.00-1.50;",
  "autonomous_driving": "Following a forensic analysis of the options landscape for the nearest weekly expiration (January 30, 2026), current dealer positioning and gamma exposure (GEX) profiles indicate the following structural boundaries and volatility pivots:\n\nMBLY:10.50,10.00,9.00,10.00,10.50-12.00,7.50-8.50;AUR:5.00,4.50,4.00,5.00,5.50-7.00,3.00-3.50;TSLA:440,420,415,440,445-475,380-410;XPEV:22.00,19.00,18.00,19.00,22.50-25.00,14.00-17.00;KDK:0",
  "uas_defense_robotics": "Analysis of the current options landscape for the week ending February 6, 2026, reveals a high concentration of dealer-driven positioning in the drone and defense sectors. Forensic analysis of market maker hedging requirements identifies key volatility pivots and liquidity gaps for the nearest expiration cycle.\n\n**DPRO**: 10.0, 8.5, 7.0, 10.0, 8.5-9.5, 7.0-8.0; \n**RCAT**: 15.0, 13.5, 13.0, 13.0, 14.0-15.0, 11.5-12.5; \n**ZENA**: 5.0, 3.75, 2.5, 5.0, 4.0-5.0, 2.5-3.5; \n**ONDS**: 12.5, 11.5, 10.0, 12.0, 11.5-12.5, 10.0-11.0; \n**AVAV**: 315.0, 285.0, 275.0, 315.0, 290.0-310.0, 275.0-285.0; \n**KTOS**: 113.0, 108.0, 105.0, 105.0, 108.0-112.0, 103.0-105.0; \n**UMAC**: 16.0, 15.0, 14.0, 14.0, 15.5-16.0, 13.5-14.5; \n**SPAI**: 0;",
  "service_robotics": "As a forensic equity options analyst, I have analyzed the current market maker and dealer positioning for the requested tickers as of **February 2, 2026**, focusing on the nearest available expirations (February 6 for weekly active tickers, and February 20 for monthly-only tickers). \n\nThe following levels represent the structural barriers dictated by dealer hedging requirements. Key resistance (Call Walls) and support (Put Walls) are identified by peak gamma concentrations, while the Gamma Flip serves as the pivot where dealer behavior shifts from suppressive (positive gamma) to accelerative (negative gamma).\n\n**RR:5.00,4.00,3.50,4.00,4.50-5.00,3.50-4.00;**\n**SERV:12.50,11.00,10.00,11.50,11.50-12.50,10.00-11.00;**\n**PRCT:35.00,32.50,30.00,30.00,32.50-35.00,27.50-30.00;**\n**ZBRA:270.00,240.00,220.00,240.00,250.00-270.00,220.00-230.00;**\n**IRBT:1.00,0.50,0.50,0.50,0.50-1.00,0.20-0.50**\n\n### **Technical Breakdown by Ticker:**\n*   **$RR (Richtech Robotics):** Current positioning shows a heavy concentration of call OI at the $5.00 strike, serving as a primary ceiling. Dealers are neutral-to-short gamma below $4.00, making the $3.50-$4.00 range a \"gamma void\" where price action can be choppy until a wall is reclaimed.\n*   **$SERV (Serve Robotics):** The $12.50 Call Wall is the dominant upside barrier. Market makers have a significant hedging pivot at $11.00; a sustained move below this level likely triggers \"short gamma\" behavior, increasing intraday volatility toward the $10.00 floor.\n*   **$PRCT (Procept BioRobotics):** Most activity is concentrated in the February 20 monthly series. The $30.00 strike is a massive \"Put Wall\" acting as a hard magnet and floor, while the Max Pain point at $30.00 suggests a pin risk for February.\n*   **$ZBRA (Zebra Technologies):** Zebra maintains a wide gamma void between $240 and $260, indicating thin dealer liquidity. The $270 strike is the gamma-weighted call barrier, while the $220 level acts as the definitive downside cushion for dealers.\n*   **$IRBT (iRobot):** Following bankruptcy developments and ticker transition to IRBTQ, options liquidity is severely impaired. The $0.50 strike contains almost the entirety of the open interest, effectively pinning the stock as both the Gamma Flip and Put Wall, with a theoretical upside void toward $1.00.",
  "space_launch_systems": "Based on a forensic analysis of the options landscape and dealer positioning as of February 2, 2026, for the nearest weekly expiration (February 6, 2026), the identified gamma levels and market maker pivots are as follows:\n\nRKLB:85.0,84.0,75.0,84.0,86.0-95.0,65.0-74.0;FLY:0;MNTS:0;SPCE:3.5,3.0,2.5,3.0,4.0-5.0,1.5-2.0;LUNR:21.0,19.0,17.5,19.0,22.0-25.0,15.0-17.0;RDW:14.0,12.0,9.5,10.5,15.0-20.0,7.0-9.0;",
  "earth_observation": "As a forensic equity options analyst specializing in dealer reflexivity and market maker positioning for the February 2026 options cycle, the landscape reveals a heavy concentration of risk in the satellite and aerospace sectors. $ASTS and $SATS exhibit the highest nominal gamma risk, while $BKSY and $SPIR show significant \"pinning\" behavior near historical support levels.\n\nTicker:callwall,gammaflip,putwall,MaxPain,upside gammavoid range,downside gammavoid range;\n**PL:30,27,20,25,28-30,20-23;**\n**BKSY:35,26,22.5,25,30-35,22.5-25;**\n**SPIR:15,12.5,7.5,13,14-15,7.5-10;**\n**SATL:5,5,2.5,2.5,5-7.5,2.5-4;**\n**ASTS:120,110,100,105,115-120,90-100;**\n**IRDM:25,21.5,17.5,21,23-25,17.5-20;**\n**SATS:130,115,105,115,125-130,105-112;**\n**VSAT:48,45,40,42,46-48,40-42;**\n\n### **Technical Summary for Active Weekly/Nearest Expiration:**\n*   **$ASTS (AST SpaceMobile):** The landscape is dominated by a massive call wall at $120. Dealers are currently net long gamma above $110, which acts as the primary volatility pivot. A breach below the $100 put wall would trigger significant delta-hedging sell pressure into the $90 downside void.\n*   **$VSAT (Viasat):** The $42 strike is the primary magnet (Max Pain), but the $48 call wall represents a significant structural barrier. The range between $42 and $45 is a \"gamma neutral\" zone where price action remains choppy.\n*   **$IRDM (Iridium):** Shows a tight consolidation with the gamma flip at $21.50. Upside movement is capped by dealer selling at $25, while the $17.50 floor is reinforced by heavy put positioning.\n*   **$BKSY (BlackSky):** Significant open interest at the $30 and $35 strikes creates a wide upside void. If the stock clears the $26 pivot, a \"gamma vacuum\" could pull it rapidly toward the $30 wall.\n*   **$SATS (EchoStar):** High-notional positioning at $115 (Max Pain) suggests a pin for the monthly expiration. The downside void from $112 to $105 indicates that any break of the $115 pivot could see high-velocity selling to the $105 floor.",
  "ev_charging_infrastructure": "As a forensic equity options analyst specializing in dealer positioning and market maker hedging flows, I have analyzed the current options landscape for the requested tickers as of February 2, 2026. Data for **CHPT** reflects the nearest weekly expiration (Feb 6, 2026), while **EVGO**, **BLNK**, **BEEM**, and **ADSE** primarily utilize the active monthly expiration (Feb 20, 2026) due to the absence of liquid weekly chains for these small-cap symbols.\n\nAnalysis indicates that market makers are currently positioned \"long gamma\" in **EVGO** and **CHPT** near their respective max pain points, acting as a volatility dampener. Conversely, **BLNK** and **BEEM** exhibit narrow gamma-positive clusters at their strikes with the highest open interest, suggesting a \"pinning\" effect as dealer delta-hedging offsets directional momentum. **ADSE** remains an extremely illiquid, low-gamma environment with significant structural voids, rendering it susceptible to high-slippage moves if the current barriers are breached.\n\nTicker:callwall,gammaflip,putwall,MaxPain,upside gammavoid range,downside gammavoid range;\nEVGO:4,3,3,3,5.0-7.0,1.0-2.0;\nBLNK:1,1,0.5,1,1.5-2.0,0-0.5;\nCHPT:8,8,6,8,10.0-14.0,2.0-4.0;\nBEEM:2.5,2.5,2.5,2.5,5.0-10.0,0-1.0;\nADSE:12.5,10,2.5,10,15.0-22.5,5.0-7.5;",
  "evtol_air_mobility": "Ticker:callwall,gammaflip,putwall,MaxPain,upside gammavoid range,downside gammavoid range;\n$achr:9.00,7.50,7.00,8.00,7.50-8.50,6.00-7.00;\njoby:11.50,11.00,10.50,15.00,12.00-14.50,9.00-10.00;\nevex:5.00,4.00,3.00,4.00,4.25-4.75,3.25-3.75;\nevtl:7.50,5.00,5.00,5.00,5.50-7.00,3.50-4.50",
  "hydrogen_fuel_cells": "As a forensic equity options analyst, I have analyzed the current market maker and dealer positioning for the requested tickers for the nearest weekly (Feb 6, 2026) and active monthly (Feb 20, 2026) expirations. The following levels represent the gamma-weighted barriers and liquidity voids identified in the options landscape:\n\nFCEL:9.5,8.5,8.5,8.5,9.5-11.0,5.0-8.5;\nBE:150.0,150.0,143.0,144.0,150.0-175.0,120.0-143.0;\nPLUG:2.5,2.20,2.0,2.5,2.5-5.0,0.5-2.0;\nHYLN:4.0,1.5,1.5,1.5,4.0-5.0,0.5-1.5;\nBW:10.0,10.0,10.0,5.0,10.0-12.5,0.0-10.0;\nBLDP:3.0,2.5,2.0,1.0,3.0-5.0,0.0-2.0;",
  "batteries_storage_tech": "Analysis of the current options landscape for $QS, $ENVX, $SES, $MVST, $AMPX, and $SLDP reveals significant dealer positioning for the February 6, 2026 (nearest weekly) and February 20, 2026 (active monthly) expirations. As a forensic analyst, I identify the following key inflection points where market maker hedging activity is expected to govern price action:\n\n**QS**:11.00,10.50,10.00,10.50,11.50-13.50,8.50-9.50;\n**ENVX**:9.00,8.50,7.50,8.00,9.50-12.00,5.00-7.00;\n**SES**:3.00,2.25,2.00,2.00,3.50-5.00,0.50-1.50;\n**MVST**:5.00,3.50,3.00,3.00,6.00-8.00,1.00-2.00;\n**AMPX**:12.00,11.00,9.00,10.00,15.00-18.00,4.00-7.00;\n**SLDP**:5.50,5.00,4.50,4.50,6.00-8.00,2.00-3.50\n\n### Analyst Commentary:\n*   **$QS & $ENVX (Weekly focus)**: High gamma concentrations at psychological strikes ($10 for QS, $8 for ENVX) suggest strong pinning action toward the Feb 6 expiration. $QS exhibits a significant Call Wall at $11.00, which will likely act as a terminal barrier unless a fundamental catalyst triggers dealer short-covering.\n*   **$AMPX**: Shows the most aggressive upside positioning with a massive Call Wall at $12.00 (over 15,000 contracts). The Gamma Flip near $11.00 suggests that a sustain above this level would transition dealers into a positive gamma regime, potentially dampening volatility.\n*   **$SES & $MVST**: These tickers remain heavily pinned to their lower-priced Put Walls. For $SES, the $2.00 strike is a significant structural floor with high dealer interest. $MVST's \"void\" above $6.00 indicates that if the $5.00 Call Wall is breached, the stock could enter a low-liquidity \"melt-up\" zone due to a lack of hedging resistance.",
  "batteries_storage_sw": "As a forensic equity options analyst specializing in dealer positioning and market maker hedging flows, I have analyzed the current options landscape for the requested tickers for the nearest active expiration (Feb 6, 2026, or the monthly Feb 20, 2026, where weeklies are unavailable). The following data reflects gamma-weighted walls and volatility pivots derived from current open interest distributions and net gamma exposure (GEX) profiles.\n\nENPH:40.00,37.00,30.00,37.00,40.00-45.00,25.00-30.00; STEM:25.00,17.50,10.00,17.50,25.00-30.00,5.00-10.00; FLNC:30.00,30.00,26.00,30.00,35.00-40.00,20.00-26.00; EOSE:16.50,16.00,16.50,15.50,16.50-18.00,10.00-12.00; GWH:0,0,0,0,0,0; KULR:4.50,4.00,3.50,4.00,5.00-6.00,2.00-3.00; TE:0,0,0,0,0,0; NRGV:5.00,5.00,1.50,1.50,6.00-7.00,1.00-2.00;\n\n**Analyst Notes:**\n*   **ENPH & EOSE:** Both exhibit pinning risk at the nearest weekly expiration (Feb 6). For EOSE, the overlap of the Call and Put walls at $16.50 indicates significant dealer suppression of realized volatility around that strike.\n*   **STEM, FLNC, KULR & NRGV:** These tickers primarily trade on monthly cycles. The nearest major expiration is Feb 20. FLNC shows a heavy call-dominated landscape with a major gamma wall at $30.00, acting as a magnetic barrier.\n*   **GWH & TE:** Data for these tickers is currently unavailable or the options chains lack sufficient open interest to identify distinct gamma-weighted barriers for the requested timeframe.\n*   **TE Ticker:** Note that ticker \"TE\" (T1 Energy, formerly FREYR Battery) is a recent rebranding; historical liquidity in its options chain is significantly lower than its solar/storage peers, resulting in unavailable gamma metrics.",
  "battery_materials_mining": "As a forensic equity options analyst focusing on dealer positioning and market maker hedging requirements, the following analysis identifies the key structural levels for the requested tickers based on the Feb 2, 2026, options landscape for the nearest active and weekly expirations (primarily Feb 6 and Feb 20, 2026).\n\nATLX:7.5,6.0,5.0,6.0,6.5-7.0,3.0-4.0; ABAT:5.0,4.5,4.0,4.5,6.0-7.0,1.0-2.0; ALB:180.0,170.0,160.0,170.0,180.0-190.0,140.0-150.0; SQM:85.0,77.5,75.0,80.0,82.5-85.0,70.0-75.0; SGML:15.0,13.0,10.0,13.0,16.0-17.0,11.0-12.0; ELVR:0; LAC:6.5,5.5,5.0,5.5,6.0-6.5,4.0-4.5; NB:8.0,6.5,6.0,7.0,8.5-9.5,4.5-5.5",
  "Hyperscalers": "Ticker:callwall,gammaflip,putwall,MaxPain,upside gammavoid range,downside gammavoid range;\nCRWV:100.00,92.50,80.00,90.00,105.00-115.00,65.00-75.00;\nNBIS:100.00,92.50,75.00,90.00,110.00-120.00,60.00-70.00;\nCORZ:20.00,18.00,17.00,17.50,21.00-24.00,14.00-16.00;\nAPLD:40.00,34.00,30.00,37.00,42.00-48.00,24.00-28.00;\nCIFR:15.00,13.50,11.00,13.00,16.00-19.00,8.00-10.00;\nWULF:16.00,14.00,11.50,13.50,17.00-20.00,9.00-10.50;",
  "Mining": "Analysis of the current options landscape for the crypto-mining sector reveals high concentration in short-term weekly expirations (February 6, 2026), primarily driven by the underlying volatility of Bitcoin and upcoming earnings catalysts for several miners. Market maker positioning shows a significant \"call heavy\" bias in names like IREN and MARA, creating potential gamma squeeze conditions if resistance levels are breached with volume. Conversely, stocks like BITF and HIVE remain pinned near their max pain points as dealers maintain delta-neutral hedges.\n\nMARA:11.00,10.50,8.00,10.00,11.50-13.00,8.50-9.50;\nCLSK:14.00,12.50,11.50,12.50,14.50-16.00,10.50-11.25;\nBITF:3.00,2.50,2.00,2.50,3.25-4.00,2.15-2.35;\nHIVE:4.00,3.50,3.00,3.00,4.25-5.00,2.75-2.90;\nBTBT:2.50,2.25,2.00,2.00,2.75-3.50,1.65-1.85;\nHUT:0,0,0,0,0,0;\nRIOT:17.50,16.50,16.50,16.50,18.50-22.00,14.50-15.50;\nIREN:60.00,55.00,50.00,54.00,62.00-68.00,48.00-52.00",
  "new_nuclear_energy": "As a forensic equity options analyst specializing in dealer positioning and market maker hedging dynamics for the February 6, 2026, weekly expiration, the following data is derived from current gamma exposure (GEX) profiles and open interest concentrations:\n\nOKLO:90,84,70,89,91-100,60-69;\nSMR:20,18.5,15,19,21-25,10-14;\nNNE:15,12.5,10,12,16-20,5-9;\nIMSR:12.5,11,7.5,10,13-15,5-7;\nUEC:20,17.5,15,16,21-25,10-14;\nCCJ:135,128,120,123,136-145,110-119;\nLEU:350,320,280,310,351-400,250-279;\nBWXT:130,120,110,115,131-140,90-109;",
  "Mag7": "As a forensic equity options analyst specializing in market maker positioning and dealer hedging mechanics, the following data represents the current options landscape for the nearest weekly expiration (February 6, 2026), based on prevailing gamma profiles, open interest concentrations, and volatility pivots.\n\nSPY:700,696,680,690,694-700,680-690;\nAAPL:270,255,245,260,260-270,245-260;\nNVDA:190,185,180,185,187-190,180-185;\nMETA:710,700,680,700,705-710,680-695;\nMSFT:450,465,400,430,435-450,400-425;\nAVGO:355,335,330,330,340-355,310-325;\nGOOG:345,335,310,330,335-345,310-325;\nAMZN:240,230,220,235,237-240,220-232;"
}