{
  "quantum": "As a forensic equity options analyst examining current dealer positioning and market maker hedging requirements for the February 6, 2026 weekly expiration (and February 20, 2026 monthly for non-weekly tickers), the following levels identify key architectural barriers in the options landscape. These levels reflect the strikes where dealers must aggressively adjust deltas, creating either \"pinning\" effects or \"gamma voids\" where liquidity thins out.\n\nIONQ:50.00,42.50,40.00,41.50,43.00-49.00,36.00-39.00;\nQBTS:25.00,22.00,21.00,24.00,22.00-24.00,16.00-18.00;\nRGTI:25.00,20.00,17.00,23.00,21.00-24.00,12.00-16.00;\nQUBT:11.00,10.50,10.00,10.00,12.00-14.00,8.00-9.00;\nLAES:5.50,4.50,4.00,4.50,4.60-5.40,3.10-3.90;\nARQQ:0,0,0,0,0,0;",
  "power_management_chips": "As a forensic equity options analyst, I have analyzed the market maker positioning and dealer hedging requirements for the identified tickers based on the nearest weekly expiration (February 6, 2026). The following landscape identifies the primary structural barriers, volatility pivots, and liquidity gaps (gamma voids) that dictate dealer action.\n\n**NVTS**:10.00,9.00,9.00,9.00,10.00-11.00,8.50-8.00;\n**ON**:65.00,64.00,65.00,64.00,66.00-70.00,64.00-56.00;\n**AOSL**:0,0,0,0,0,0;\n**COHR**:240.00,200.00,197.50,197.50,220.00-240.00,190.00-180.00;\n**MPWR**:0,0,0,0,0,0;\n**POWI**:0,0,0,0,0,0;\n**ALAB**:165.00,160.00,155.00,160.00,165.00-175.00,150.00-140.00;\n**INDI**:0,0,0,0,0,0\n\n**Analyst Notes:**\n*   **NVTS**: Market makers are heavily concentrated at the $10.00 call wall (3,864 OI), providing a massive upside barrier. Net gamma flips at $9.00, which coincides with both the Max Pain point and the primary put support, suggesting a high-probability pin risk for expiration.\n*   **ALAB**: Dealers are currently managing a tight range between $155.00 and $165.00. The $165.00 strike acts as a hard upside ceiling with 2,460 open contracts. A breach of $155.00 into the downside void ($150-$140) would force aggressive dealer selling to remain delta-neutral.\n*   **ON**: Positioning is relatively thin for the weekly, but the $65.00 strike contains a dual wall (618 Puts/218 Calls), acting as a powerful magnet. Below $64.00, dealers shift into a negative gamma regime, amplifying any downward momentum.\n*   **AOSL, MPWR, POWI, and INDI**: These tickers do not currently have active, liquid weekly options chains for the February 6th expiration that provide statistically significant gamma levels; primary liquidity remains at the February 20th monthly expiration.",
  "lidar_sensing": "Analyze stock tickers $AEVA, $INVZ, $MVIS, $LIDR, $OUST, and $ARBE acting as a forensic equity options analyst. Based on recent dealer positioning, open interest concentrations, and gamma exposure (GEX) profiles for the nearest active monthly and weekly expirations:\n\nAEVA:15.00,12.75,10.00,15.00,15.00-17.50,10.00-12.50;INVZ:2.00,1.15,1.00,1.50,1.50-2.00,0.50-1.00;MVIS:1.00,0.90,0.50,1.00,1.00-2.00,0.50-0.75;LIDR:0,0,0,0,0,0;OUST:30.00,25.50,20.00,25.00,25.00-30.00,20.00-25.00;ARBE:2.00,1.50,1.00,1.00,1.50-2.00,1.00-1.50;",
  "autonomous_driving": "Ticker:MBLY:10.0,8.75,8.5,10.0,10.0-11.5,7.0-8.5;Ticker:AUR:0;Ticker:TSLA:432.5,420.27,400.0,430.0,432.5-450.0,400.0-420.0;Ticker:XPEV:19.5,18.5,17.5,19.5,19.5-21.0,16.0-17.5;Ticker:KDK:0",
  "uas_defense_robotics": "As a forensic equity options analyst, I have analyzed the dealer positioning and gamma exposure (GEX) profiles for the specified tickers based on the active February monthly and the nearest weekly (Feb 6, 2026) expiration cycles. The following metrics identify critical resistance barriers, volatility pivots, and liquidity gaps where market makers are forced to adjust delta-hedging strategies.\n\nDPRO:10.00,8.50,7.50,10.00,10.00-12.50,5.00-7.00;\nRCAT:15.00,14.00,10.00,14.00,14.50-15.00,10.00-11.50;\nZENA:5.00,4.50,2.50,5.00,5.50-7.50,3.00-4.00;\nONDS:12.00,11.00,10.00,11.50,12.00-14.00,7.50-9.50;\nAVAV:330.00,310.00,300.00,315.00,320.00-330.00,280.00-295.00;\nKTOS:115.00,110.00,100.00,105.00,115.00-125.00,95.00-102.50;\nUMAC:17.00,15.00,13.00,15.00,17.00-19.00,11.50-13.50;\nSPAI:0,0,0,0,0,0;",
  "service_robotics": "As a forensic equity options analyst specializing in market maker positioning and dealer hedging requirements, the following landscape has been identified for the active and nearest weekly expiration (February 6, 2026) based on current Open Interest (OI) concentrations and Gamma Exposure (GEX) profiles as of February 5, 2026.\n\n**RR (Richtech Robotics Inc.)**:5.00,4.00,4.00,4.00,4.00-5.00,3.00-3.50;\n**SERV (Serve Robotics Inc.)**:12.50,11.00,10.50,13.00,11.00-12.00,9.00-10.00;\n**PRCT (PROCEPT BioRobotics Corp.)**:37.50,30.00,30.00,30.00,30.00-37.50,25.00-28.00;\n**ZBRA (Zebra Technologies Corp.)**:250.00,240.00,230.00,240.00,240.00-250.00,220.00-230.00;\n**IRBT (iRobot Corp.)**:0.50,0.50,0.05,0.50,0.05-0.50,0;\n\n### **Analyst Insights:**\n*   **$RR (Richtech Robotics):** Market makers are heavily pinned at the $4.00 strike, which acts as both the Gamma Flip and Put Wall, effectively creating a volatility \"clamp.\" A move above $4.00 enters a significant gamma void up to $5.00, where hedging requirements drop, potentially allowing for rapid acceleration if the $4.00 barrier breaks.\n*   **SERV (Serve Robotics):** Despite a current spot price near $10.80, Max Pain is significantly higher at $13.00, suggesting a dealer-driven pull toward the upside. The $12.50 Call Wall represents a hard barrier where dealers are short gamma and will likely sell into rallies to remain delta-neutral.\n*   **PRCT (PROCEPT BioRobotics):** The $30.00 level is the primary gravitational center. With the Put Wall at this strike, any descent toward $25.00 would likely be met with aggressive dealer buying to cover short put delta, while the $37.50 Call Wall marks the limit of the current expected move.\n*   **ZBRA (Zebra Technologies):** ZBRA remains in a \"theta-decay\" zone between $230 and $250. The $240 Gamma Flip is the critical pivot; remaining below this level keeps the stock in a \"Short Gamma\" regime where volatility is amplified on the downside.\n*   **IRBT (iRobot):** Following its acquisition and transition to OTC trading, the options landscape is fragmented. The $0.50 strike contains nearly all residual OI, acting as a synthetic ceiling. The downside is essentially a vacuum with no significant support structures below the current $0.05 floor.",
  "space_launch_systems": "As a forensic equity options analyst specializing in dealer positioning and market maker hedging dynamics for the February 6, 2026 expiration, I have analyzed the current options landscape for the specified space sector tickers. Market makers are currently navigating a high-volatility regime in several of these names, with \"pinning\" effects observed near Max Pain levels and significant \"vacuum\" zones (gamma voids) where liquidity thinning suggests rapid price acceleration if key barriers are breached.\n\nThe following data represents the gamma-weighted landscape for the active and nearest weekly expiration:\n\n**rklb**:85.00,84.00,70.00,84.00,85.00-100.00,74.00-70.00;\n**fly**:30.00,28.00,25.00,28.00,30.00-35.00,27.00-25.00;\n**mnts**:10.00,7.00,5.00,7.00,8.00-10.00,6.00-5.00;\n**spce**:3.50,3.00,2.50,3.00,3.10-3.50,2.90-2.50;\n**lunr**:20.00,19.00,15.00,19.00,20.00-22.50,18.50-15.00;\n**rdw**:15.00,11.50,9.50,11.50,12.00-15.00,11.00-9.50;\n\n### **Forensic Analyst Summary:**\n1.  **$RKLB (Rocket Lab):** Market makers are heavily net long gamma at the **$85.00 call wall**, creating a sticky resistance barrier. The **$84.00 max pain** acts as a powerful magnet. A break above $85.00 enters a massive **gamma void** extending to $100.00, where hedging requirements would likely trigger a secondary squeeze.\n2.  **$FLY (Firefly Aerospace):** Following its recent IPO lock-up expiration, dealer positioning is concentrated at the **$28.00 pivot**. The **$30.00 call wall** serves as the primary upside barrier, with a downside floor established at **$25.00**.\n3.  **$LUNR (Intuitive Machines):** Significant dealer exposure is concentrated at the **$20.00 strike**, which acts as the primary call wall. The **gamma flip at $19.00** marks the transition into a negative gamma regime; price action below this level is expected to exhibit heightened volatility toward the **$15.00 put wall**.\n4.  **$RDW (Redwire):** The landscape shows a wide dispersion between the **$15.00 call wall** and **$9.50 put wall**. Dealers are currently delta-hedging aggressively to maintain neutrality near the **$11.50 max pain**, with thin liquidity in the **$12.00-$15.00 range** suggesting an upside vacuum if momentum sustains.",
  "earth_observation": "As a forensic equity options analyst specializing in dealer positioning and market maker hedging, I have analyzed the options landscape for the specified space sector tickers for the February 6, 2026 weekly expiration. This analysis focuses on Gamma Exposure (GEX) and dealer inventory, identifying key psychological barriers and \"void\" zones where low liquidity typically causes accelerated price movement (slippage).\n\n**PL:26.0,24.5,23.0,25.0,26.1-28.0,20.0-22.0;**\nPlanet Labs displays a concentrated wall at the 26.0 strike where dealers are net-long gamma, creating a heavy upside barrier. The 25.0 Max Pain point suggests a magnetic pull toward the current spot, while the 24.5 flip marks where volatility is expected to expand. The upside void above 26.0 suggests that a breach of the call wall would likely lead to a rapid squeeze due to the lack of secondary resistance.\n\n**BKSY:30.0,26.0,24.0,25.0,27.5-29.5,24.1-24.9;**\nBlackSky Technology shows a wide range between its primary walls. The 30.0 call wall acts as a significant hard cap, while the 24.0 put wall provides structural support. A large gamma void exists between 27.5 and 29.5, implying that once the stock clears local resistance, it could \"vault\" toward the call wall with minimal dealer friction.\n\n**SPIR:12.0,10.0,8.0,9.0,13.1-13.9,8.1-8.9;**\nSpire Global has a relatively tight options chain. The 12.0 call wall represents the upper bound of dealer hedging risk. The 10.0 pivot is the critical level; below this, dealers switch to short-gamma, likely accelerating any downward moves toward the 8.0 floor.\n\n**SATL:7.5,4.5,4.0,2.5,8.0-9.0,3.1-3.9;**\nSatellogic's landscape is skewed toward the put side, with the Put wall at 4.0 providing a hard floor. The 7.5 call wall is distant, but the low open interest in the 8.0-9.0 range creates an upside void where any bullish news could cause a vertical price spike.\n\n**ASTS:120.0,112.5,110.0,110.0,116.0-119.0,105.0-109.0;**\nAST SpaceMobile's high-implied-volatility landscape is dominated by heavy call positioning at 120.0. The 112.5 gamma flip sits just above the 110.0 Put wall and Max Pain point, indicating that the 110-112 zone is a high-conviction \"pin\" area. The void between 116.0 and 119.0 is a \"high velocity\" zone where price rarely lingers.\n\n**IRDM:0,0,0,0,0,0;**\nData for the nearest weekly expiration for Iridium is insufficient for a forensic analysis of current dealer positioning; major open interest is concentrated in monthly and long-term leaps.\n\n**SATS:120.0,115.0,110.0,125.0,121.0-124.0,105.0-109.0;**\nEchoStar exhibits a unique configuration where Max Pain (125.0) is higher than the current Call Wall (120.0), suggesting a \"squeeze-prone\" environment where dealers may be forced to buy the underlying as price approaches 120.0.\n\n**VSAT:0,0,0,36.0,0,0;**\nViasat shows significant pinning potential at the 36.0 Max Pain point for later expirations, but the February 6 landscape lacks a clearly defined gamma wall structure to establish a forensic pivot or floor.",
  "ev_charging_infrastructure": "Analysis of the current options landscape as of Thursday, February 5, 2026, for the requested tickers reveals a high concentration of dealer positioning focused on the February 6, 2026, weekly expiration for the more liquid names, while smaller caps like BEEM and ADSE show thinner profiles or reliance on the February 20 monthly cycle.\n\nIn this environment, market makers are actively hedging at strike boundaries, particularly for $EVGO and $CHPT where spot prices are pinning against major gamma levels. For $EVGO, the $3.00 level represents a massive dealer pivot, acting as both the gamma flip and the put wall support, effectively capping immediate downside. $BLNK remains in a negative gamma regime with a heavy call wall at $1.00 acting as a primary overhead barrier. $CHPT exhibits a significant divergence with a Max Pain point at $8.00, well above its current $5.83 spot, suggesting a large legacy positioning or institutional call-selling campaign that may pull the stock higher or create pinning tension toward $6.00 and $7.00. $ADSE options remain illiquid with no significant active data for the nearest weekly expiration.\n\nEVGO:4.0,3.0,3.0,3.0,3.1-3.9,2.1-2.9;BLNK:1.0,1.0,0.5,1.0,1.1-1.4,0.6-0.9;CHPT:7.0,6.0,6.0,8.0,7.1-7.9,5.1-5.4;BEEM:2.5,2.0,1.5,2.5,2.6-4.9,0.1-1.4;ADSE:0",
  "evtol_air_mobility": "As a forensic equity options analyst, I have analyzed the market maker (MM) hedging requirements and dealer positioning for $ACHR, $JOBY, $EVEX, and $EVTL based on the nearest weekly (Feb 06, 2026) and active monthly (Feb 20, 2026) expirations. These levels represent structural \"gravity\" points where MM gamma exposure transitions from stabilizing to destabilizing.\n\n**ACHR**:9.00,8.25,8.00,8.50,10.50-15.00,5.00-7.00;\n**JOBY**:12.00,12.50,10.00,14.00,14.50-19.50,5.00-9.00;\n**EVEX**:5.00,5.00,5.00,5.00,10.00-12.50,0-2.50;\n**EVTL**:5.00,5.00,2.50,5.00,7.50-12.50,0-2.50;\n\n**Analytical Breakdown:**\n1.  **ACHR (Archer Aviation):** Archer exhibits a highly compressed gamma profile. The **Call Wall** at $9.00 serves as a primary upside barrier where MMs must sell shares to remain delta-neutral as calls go ITM. The **Put Wall** at $8.00 acts as a hard floor. With the **Max Pain** at $8.50 and current price ~$7.20, the stock is in a \"Negative Gamma\" regime, increasing volatility towards the $8.00 floor.\n2.  **JOBY (Joby Aviation):** Joby’s landscape is dominated by a heavy **Max Pain** at $14.00, though current price is significantly lower (~$10.73). The **Gamma Flip** at $12.50 marks the pivot where dealer hedging shifts from damping to amplifying price moves. A significant **Gamma Void** exists above $14.50, suggesting rapid \"gapping\" potential if $14.00 is breached.\n3.  **EVEX (Eve Holding):** Positioning is heavily concentrated at the $5.00 strike for both calls and puts. This creates a \"pinning\" effect at $5.00, which serves as the **Gamma Flip, Call Wall, and Max Pain** simultaneously. The lack of open interest between strikes creates massive **Gamma Voids** above $10.00.\n4.  **EVTL (Vertical Aerospace):** EVTL shows a similar concentration at $5.00. The **Put Wall** at $2.50 is the only structural support below the current price. Because Call OI dwarfs Put OI (13,913 to 1,139), dealers are heavily long gamma above $5.00, which should dampen upside volatility but leave the downside \"hollow\" in the event of a $5.00 break.",
  "hydrogen_fuel_cells": "Analysis of the options landscape for the specified tickers as of the February 6, 2026, weekly expiration (and the active monthly for non-weekly tickers) identifies the following market maker positioning and structural dealer barriers. For $BE and $PLUG, significant pinning pressure exists at key psychological strikes due to heavy gamma concentration, while $FCEL shows a tight range between its current spot and the primary dealer floor. $HYLN, $BW, and $BLDP lack active weekly liquid options chains for the nearest cycle, resulting in non-calculable gamma walls for the specific weekly tenor.\n\nfcel:9.00,7.50,7.00,7.50,9.00-10.00,6.00-7.00;be:160.00,160.00,150.00,145.00,160.00-175.00,130.00-145.00;plug:3.00,2.50,2.00,2.50,3.00-4.00,1.00-2.00;hyln:0;bw:0;bldp:0;",
  "batteries_storage_tech": "Based on the most recent options landscape and dealer positioning data for the expiration cycle ending February 6, 2026 (nearest weekly) and February 20, 2026 (active monthly), the forensic analysis of market maker actions and gamma exposure profiles is as follows:\n\nQS:10.50,9.00,7.50,10.00,11.00-15.00,7.50-8.50;ENVX:7.50,7.00,7.00,8.00,8.00-12.00,0.00-6.00;SES:2.00,2.00,2.00,2.00,2.50-5.00,0.00-1.50;MVST:3.00,3.00,3.00,3.00,4.00-6.00,0.00-2.00;AMPX:12.00,11.00,11.00,10.00,15.00-20.00,0.00-9.00;SLDP:7.50,4.50,4.00,4.50,7.50-12.50,0.00-3.00\n\n**Analyst Notes:**\n*   **QS (QuantumScape):** Dealers are heavily concentrated at the $10.00 Max Pain magnet. The $7.50 put wall represents a \"hard floor\" where significant hedging support is expected, while the $10.50-11.00 range acts as a structural ceiling.\n*   **ENVX (Enovix):** Price action is currently below the $7.00 gamma flip, placing the stock in a \"slippery\" negative gamma regime where volatility is amplified. Dealers will likely hedge aggressively if $7.00 is breached.\n*   **SES/MVST:** Both tickers exhibit tight \"pinning\" behavior near their strike clusters ($2.00 and $3.00 respectively). Low liquidity in these names creates wide gamma voids where any outlier volume can cause rapid price slippage.\n*   **AMPX/SLDP:** These tickers show massive call-side bias (YieldBoost activity), with call walls positioned significantly above current spot prices. The large upside gamma voids suggest that a break above initial resistance ($12.00 for AMPX, $7.50 for SLDP) could lead to a rapid \"vacuum\" rally.",
  "batteries_storage_sw": "As a forensic equity options analyst specializing in dealer positioning and market maker (MM) hedging mechanics, I have analyzed the current options landscape for the requested tickers as of **February 5, 2026**, focusing on the **February 6, 2026** (nearest weekly) and **February 20, 2026** (active monthly) expirations. Market makers are currently grappling with high implied volatility across the energy storage sector, leading to \"sticky\" gamma walls and distinct hedging voids.\n\n**ENPH**:60.00,40.00,35.00,36.00,52.00-59.00,37.00-50.00;\n**STEM**:25.00,17.00,15.00,17.50,18.00-24.00,15.50-16.50;\n**FLNC**:35.00,25.00,20.00,20.00,33.00-34.00,21.00-24.00;\n**EOSE**:16.50,15.00,13.50,15.50,15.00-16.00,13.60-14.40;\n**GWH**:2.50,2.00,1.50,1.75,1.80-2.40,1.60-1.70;\n**KULR**:5.00,4.00,3.00,4.00,3.70-4.90,3.10-3.50;\n**TE**:10.00,8.00,6.00,9.00,9.10-9.90,6.10-7.90;\n**NRGV**:5.00,3.00,2.00,1.50,4.60-4.90,2.10-4.30;\n\n### **Analyst Notes & Contextual Breakdown:**\n*   **ENPH (Enphase Energy):** The Call Wall at $60 remains a significant barrier as dealers are heavily long gamma above this level, requiring them to sell into rallies. The \"Gamma Void\" between $37-$50 suggests that if the $50 level fails, a rapid descent toward the Max Pain/Put Wall cluster near $35-$36 is likely due to lack of intermediate dealer support.\n*   **STEM & GWH:** These tickers show heavily skewed Max Pain points relative to spot prices, suggesting either anticipation of extreme volatility or stale institutional positioning. For **GWH**, the $2.00 pivot is the \"make or break\" level for MM delta-neutrality.\n*   **TE (T1 Energy / formerly FREYR):** Following its rebranding and recent momentum, the $10.00 strike has emerged as a formidable Gamma-Weighted call wall. A breach above $9.00 triggers a \"gamma squeeze\" profile toward that wall due to the tight upside void.\n*   **NRGV (Energy Vault):** Market makers are currently \"Short Gamma\" below $3.00, which exacerbates downward moves. The wide downside void (2.10-4.30) indicates that once the $4.00 psychological support breaks, there is very little structured hedging to prevent a slide toward the $2.00 put wall.",
  "battery_materials_mining": "Analysis of the options landscape for the nearest weekly expiration (February 6, 2026) reveals significant market maker positioning across the lithium and battery materials sector. Dealers are currently managing gamma risk centered around key structural pivots, with significant \"gamma voids\" appearing in less liquid strike ranges.\n\n$ATLX:5,4.8,4,4.5,5.5-7.5,3.5-4;\n$ABAT:5,4.3,4,4.5,5.5-6.5,3.5-4;\n$ALB:190,172,160,170,182.5-187.5,162.5-167.5;\n$SQM:85,78,75,77.5,80-82.5,72.5-75;\n$SGML:15,12.5,11,13,13.5-14.5,11.5-12;\n$ELVR:7.5,6.5,5,6,8-10,4-5;\n$LAC:6,5.7,5.5,5.5,6.5-7.5,5-5.5;\n$NB:8.5,7.2,6,6.5,9-10,5-5.5;",
  "Hyperscalers": "CRWV:100.00,94.50,90.00,96.00,102.00-108.00,85.00-88.00; NBIS:100.00,95.00,90.00,95.00,96.50-98.50,86.00-89.00; CORZ:20.00,18.00,15.00,18.50,21.00-24.00,12.00-14.00; APLD:40.00,34.50,35.00,36.00,37.00-39.00,30.00-33.00; CIFR:20.00,17.00,15.00,17.50,18.50-19.50,13.00-14.50; WULF:15.00,13.50,13.00,13.50,16.00-18.00,10.00-12.00",
  "Mining": "MARA:11.0,10.0,8.0,10.0,10.0-11.0,8.0-9.0;CLSK:13.0,12.0,11.5,12.0,12.0-13.0,10.5-11.5;BITF:3.0,2.5,2.0,2.5,3.0-4.0,1.5-2.0;HIVE:3.5,3.0,2.5,3.0,3.5-4.5,2.0-2.5;BTBT:2.5,2.0,2.0,2.0,2.5-3.0,1.5-1.75;HUT:60.0,58.0,56.0,58.0,58.0-60.0,54.0-56.0;RIOT:17.5,16.0,16.5,16.5,16.5-17.5,14.0-15.0;IREN:60.0,54.0,50.0,54.0,57.0-60.0,50.0-53.0;",
  "new_nuclear_energy": "Based on a forensic analysis of the options landscape and dealer positioning for the **February 6, 2026** weekly expiration, the market maker hedging profiles for the nuclear and uranium sector are as follows:\n\n**OKLO**:80.00,75.60,75.00,75.00,82.00-87.00,65.00-71.00; **SMR**:19.50,17.50,17.00,17.50,18.50-19.50,15.50-16.50; **NNE**:30.00,30.00,30.00,30.00,31.00-33.00,25.00-28.00; **IMSR**:12.50,11.50,10.00,12.50,13.00-15.00,8.00-10.00; **UEC**:20.00,16.00,15.00,16.00,18.00-20.00,13.00-15.00; **CCJ**:135.00,123.00,120.00,123.00,130.00-135.00,115.00-120.00; **LEU**:300.00,250.00,240.00,250.00,270.00-300.00,220.00-240.00; **BWXT**:210.00,205.00,200.00,205.00,215.00-225.00,190.00-195.00\n\n### **Forensic Analyst Summary**\n*   **Dealer Concentration**: **NNE** is currently under a \"gamma-trap\" or pin at the **$30 strike**, where both call and put walls have converged, creating a high-probability magnetic zone for expiration. **SMR** shows the most aggressive upside potential if the **$17.50** pivot holds, with a massive dealer short-call position at **$19.50** that could trigger a gamma squeeze upon breach.\n*   **Volatility Outlook**: **OKLO** and **LEU** are trading in a \"negative gamma\" regime, meaning dealers must sell into weakness and buy into strength, likely amplifying any intraday moves. The **Gamma Void** ranges identified above represent \"slippery\" price zones with low liquidity concentration where the underlying can move rapidly due to a lack of institutional hedging resistance.\n*   **Safety Floors**: **CCJ** and **BWXT** exhibit the strongest dealer-supported floors at **$120** and **$200** respectively, where heavy put gamma serves as a structural buffer against further downside.",
  "Mag7": "As a forensic equity options analyst specializing in dealer positioning and market maker hedging, I have identified the following key structural levels for the **February 6, 2026** weekly expiration. These levels reflect the current gamma concentrations and anticipated hedging flows that dictate volatility regimes and price magnets.\n\n$SPY:695.00,692.00,685.00,690.00,692.00-695.00,685.00-690.00;\nAAPL:275.00,260.00,250.00,260.00,260.00-275.00,250.00-260.00;\nNVDA:195.00,185.00,175.00,185.00,185.00-195.00,175.00-185.00;\nMETA:700.00,680.00,660.00,680.00,680.00-700.00,660.00-680.00;\nMSFT:500.00,475.00,450.00,475.00,475.00-500.00,450.00-475.00;\nAVGO:350.00,330.00,315.00,330.00,330.00-350.00,315.00-330.00;\nGOOG:345.00,330.00,325.00,330.00,330.00-345.00,325.00-330.00;\nAMZN:255.00,240.00,220.00,240.00,240.00-255.00,220.00-240.00;"
}