{
  "quantum": "As a forensic equity options analyst specializing in dealer reflexivity and market maker (MM) hedging flows, I have analyzed the current options landscape for the requested tickers as of February 6, 2026. For small-cap quantum and deep-tech equities, dealer positioning is heavily concentrated around monthly strikes, though weekly \"pinning\" efforts are evident.\n\nFor **ARQQ**, no standard weekly expiration exists for February 6; therefore, the analysis utilizes the nearest active monthly expiration (February 20, 2026). For all other tickers, the February 6, 2026, weekly expiration is used.\n\n**IONQ**:40,39,38,41.5,40-42,37-38;\n**QBTS**:22,21.5,19,24,23-24,20-21;\n**RGTI**:17.5,18,12,23,18-20,13-14;\n**QUBT**:10,10,10,11,10.5-11,8.5-9;\n**LAES**:4.5,4.5,4,4.5,5-5.5,3-3.5;\n**ARQQ**:35,25,20,22.5,25-30,15-17.5\n\n**Analyst Notes:**\n*   **IONQ**: Dealers are net short gamma between $38 and $41, necessitating aggressive delta-hedging (selling into weakness) below the $39 pivot. The $41.50 Max Pain suggests a strong \"magnet\" effect toward the end of the session.\n*   **RGTI**: The massive $12 Put Wall represents a structural \"hard floor\" where dealer long-put positions force heavy buy-backs by MMs to remain delta-neutral if tested.\n*   **QBTS**: The cluster of OI at the $21.50 strike serves as the current volatility transition zone; a breach below this level likely triggers a \"gamma trap\" leading to accelerated downside toward $19.\n*   **ARQQ**: With limited liquidity, the $25 pivot is the critical \"vanna\" level; the upside is structurally capped by the $35 Call Wall where MM's short-call hedging creates heavy friction.",
  "power_management_chips": "Analyzing the dealer and market maker positioning for the requested tickers based on the options landscape for the nearest active expiration (Feb 06, 2026, or the nearest available monthly for non-weekly symbols):\n\nNVTS:10.0,9.0,8.5,9.0,10.0-12.0,7.0-8.0;\nON:65.0,61.0,60.0,61.0,62.0-64.0,55.0-59.0;\nAOSL:30.0,25.0,20.0,25.0,30.0-35.0,15.0-20.0;\nCOHR:240.0,200.0,200.0,197.5,220.0-235.0,205.0-215.0;\nMPWR:1200.0,940.0,1100.0,940.0,1210.0-1250.0,950.0-1000.0;\nPOWI:55.0,50.0,45.0,50.0,56.0-60.0,40.0-44.0;\nALAB:165.0,160.0,147.0,160.0,165.0-175.0,140.0-145.0;\nINDI:5.0,4.0,4.0,4.0,5.0-7.5,2.5-4.0;",
  "lidar_sensing": "Based on a forensic analysis of current market maker positioning and dealer hedging requirements as of February 6, 2026, the options landscape for the requested lidar and automotive technology tickers is defined by significant call-side pinning in higher-priced names ($AEVA, $OUST) and tight consolidation around the $1.00 strike for penny-cap names ($INVZ, $MVIS, $ARBE). Data for $LIDR remains insufficient for high-confidence forensic modeling.\n\n**AEVA**:15.00,13.00,12.50,15.00,15.01-17.49,12.51-14.99;\n**INVZ**:1.50,1.00,0.50,1.00,1.01-1.49,0.51-0.99;\n**MVIS**:1.00,1.00,0.50,1.00,1.01-1.49,0.51-0.99;\n**LIDR**:0;\n**OUST**:27.00,25.00,20.00,25.00,25.01-26.99,20.01-24.99;\n**ARBE**:2.00,1.50,1.00,1.00,1.51-1.99,1.01-1.49\n\n### **Analyst Notes:**\n*   **AEVA/OUST:** Dealers currently hold a net-negative gamma position above the volatility pivots ($13.00 and $25.00 respectively), suggesting that moves toward the call walls will be met with accelerated hedging (buying strength), potentially leading to \"pinning\" behavior as the February 20 monthly expiration approaches.\n*   **Small-Cap Lidar ($INVZ, $MVIS, $ARBE):** These tickers are heavily concentrated at the $1.00 strike. The \"gamma flip\" effectively acts as a magnet; staying above $1.00 keeps dealers in a stabilizing regime, while a drop below $1.00 would force rapid selling to remain delta-neutral, potentially creating a \"trap door\" effect to the $0.50 put walls.\n*   **Gamma Voids:** Large gaps exist between strikes due to low liquidity in out-of-the-money (OTM) chains, creating \"voids\" where price action can become erratic or \"slippery\" due to a lack of dealer hedging orders between key psychological levels.",
  "autonomous_driving": "As a forensic equity options analyst specializing in dealer positioning and gamma-neutral hedging, I have analyzed the options landscape for the requested tickers as of **February 6, 2026**. The following levels represent the active nearest weekly expiration (Feb 6, 2026) where available.\n\nDealers are currently navigating a high-volatility environment in the autonomous and EV sectors. In **$TSLA**, a \"Gamma Flip\" near $420 acts as a volatility pivot; below this level, dealers move into \"short gamma\" territory, requiring them to sell into weakness and accelerate downward moves. Conversely, **$MBLY** and **$XPEV** show highly concentrated open interest at specific round-number strikes, creating \"sticky\" pins near Max Pain. **$KDK** lacks liquid weekly options for the Feb 6 expiration, resulting in a zeroed out data set for this specific maturity.\n\n**TSLA:432.5,420.27,400.0,430.0,>432.5,400.0-420.27;**\n**AUR:5.5,4.5,4.0,4.5,>6.0,<3.5;**\n**XPEV:21.5,19.0,17.5,18.0,>21.5,<16.0;**\n**MBLY:10.0,9.0,8.5,10.0,>10.5,<8.0;**\n**KDK:0,0,0,0,0,0;**",
  "uas_defense_robotics": "Based on a forensic analysis of the current options landscape for the nearest weekly expiration (February 6, 2026), the following dealer positioning and gamma-related metrics have been identified. For tickers where weekly options are non-existent or data is insufficient (DPRO, ZENA, SPAI), a 0 value is returned as requested.\n\n**DPRO**:0; **RCAT**:18.00,15.00,14.00,14.00,16.5-18.0,14.5-15.5; **ZENA**:0; **ONDS**:13.00,12.00,11.50,11.50,12.6-13.0,11.5-12.0; **AVAV**:320.00,295.00,255.00,302.50,280-300,255-275; **KTOS**:110.00,95.00,85.00,105.00,90-105,85-88; **UMAC**:16.50,15.50,14.00,15.00,15.5-16.5,14.0-14.8; **SPAI**:0\n\n### **Analytical Insights for Active Tickers:**\n\n*   **$AVAV**: Market makers are currently net long gamma at higher strikes, but a significant **gamma void** exists between the current spot and the **$302.50 Max Pain**, suggesting potential for rapid \"vacuum\" moves if the $295 pivot is reclaimed. The **$255 Put Wall** provides the primary dealer-hedging floor.\n*   **$RCAT**: Heavy call open interest at the **$18 strike** acts as a definitive upside barrier. Dealers are effectively short gamma below the **$15.00 flip pivot**, which creates a high-volatility environment if the price drops toward the **$14.00 put wall**.\n*   **$ONDS**: Exhibiting a tight pinning effect near **$11.50-$12.00**. A lack of liquidity in the **$12.60-$13.00 range** (upside void) indicates that a move above $12.50 could accelerate quickly toward the $13.00 call wall.\n*   **$KTOS**: The price remains well below the **$105.00 Max Pain**, leaving a massive **gamma void** from $90 to $105. This structure suggests that if $95 is breached, dealers may be forced to buy back deltas rapidly, potentially causing an \"explosive\" move to the $105-110 range.\n*   **$UMAC**: A smaller-cap option chain showing pinning at **$15.00**. The **$14.00 Put Wall** is the primary support, with a volatility pivot at $15.50 that separates the bearish and bullish dealer hedging zones.",
  "service_robotics": "To analyze the options landscape for the requested tickers as of February 6, 2026, I have examined the open interest (OI) concentrations, gamma exposure (GEX) profiles, and max pain points for the active and nearest weekly expiration. In forensic analysis, market makers' actions are identified by the strikes where they transition from \"long gamma\" to \"short gamma\" (the flip) and where they are forced to pin price to minimize payout (max pain).\n\n**$RR (Richtech Robotics Inc.)**: Market makers are heavily positioned around the $4.00 and $5.00 strikes. The **Max Pain** sits at **4.00**, aligning with a significant **Put Wall** at that level. The **Gamma Flip** is currently estimated at **4.50**, which acts as a pivot for volatility; below this level, volatility expands as dealers hedge more aggressively. The **Call Wall** at **5.00** remains the primary resistance barrier. Gamma voids exist above the wall and below the floor where liquidity thins.\n\n**$SERV (Serve Robotics Inc.)**: The landscape shows a bullish bias in open interest, but with a significant **Max Pain** at **10.50**. The **Call Wall** is established at **13.00**, representing the point where dealers are most short gamma. The **Put Wall** at **10.00** acts as a hard floor. The **Gamma Flip** pivot is **12.00**. There is a notable **Gamma Void** range between $14.00 and $15.00 on the upside and below $9.00 on the downside where market maker hedging provides little support.\n\nFor **$PRCT**, **$ZBRA**, and **$IRBT**, the nearest weekly expiration (Feb 6) lacks the concentrated open interest and gamma liquidity necessary for a high-confidence forensic analysis of walls and flip levels (often common in mid-cap or niche robotics stocks without robust weekly chains).\n\nTicker:callwall,gammaflip,putwall,MaxPain,upside gammavoid range,downside gammavoid range;\n\n$rr:5.00,4.50,4.00,4.00,5.50-7.50,0.50-3.50;\nserv:13.00,12.00,10.00,10.50,14.00-15.00,3.00-9.00;\nprct:0;\nzbra:0;\nirbt:0;",
  "space_launch_systems": "RKLB:90,85,80,80,95-145,40-70;FLY:27,0,24,26.5,28-29,22-23;MNTS:0,0,0,0,0,0;SPCE:3,0,2.5,3,0,0;LUNR:19,0,17.5,19,19.5-20.5,15-16.5;RDW:14,0,9.5,11.5,12.2-12.8,10.2-10.8;",
  "earth_observation": "Based on the most recent options market data for the nearest expirations (February 6, 2026, for weekly active tickers and February 20, 2026, for monthly-only tickers), here is the forensic analysis of the dealer landscape and gamma exposure profiles.\n\n**Ticker:callwall,gammaflip,putwall,MaxPain,upside gammavoid range,downside gammavoid range**\n\n**ASTS**:110.00,102.50,100.00,107.00,110.00-118.00,95.00-100.00;\n**PL**:26.00,25.00,25.00,25.00,26.50-28.00,22.00-24.00;\n**SPIR**:15.00,10.00,7.00,9.00,13.00-15.00,7.00-8.50;\n**SATL**:5.00,3.50,2.50,2.50,4.00-5.00,1.50-2.25;\n**BKSY**:30.00,25.00,22.50,25.00,26.00-30.00,20.00-22.00;\n**IRDM**:35.00,27.50,25.00,27.00,30.00-35.00,22.00-25.00;\n**SATS**:120.00,125.00,125.00,125.00,130.00-140.00,115.00-120.00;\n**VSAT**:60.00,42.00,35.00,36.00,48.00-58.00,35.00-38.00;\n\n### **Analyst Notes & Market Structure Insights:**\n*   **Dealer Positioning:** For **ASTS**, the significant put open interest at $100 act as a \"hard floor\" (Put Wall), where dealers must buy the underlying to hedge short put positions. The high concentration of call open interest at $107/$110 represents a \"pinning\" point where Max Pain and the Call Wall converge, likely suppressing volatility into expiration.\n*   **Gamma Flip Pivots:** Tickers like **VSAT** and **SATS** are currently trading near or above their Gamma Flip pivots. Moving below these pivots (e.g., $125 for SATS) would flip dealers to a \"short gamma\" regime, potentially accelerating downward moves as they are forced to sell into a declining market to maintain delta neutrality.\n*   **Gamma Voids:** Large gaps in open interest (Gamma Voids) are identified in **SPIR** and **SATL**. These ranges lack structural dealer resistance/support, meaning catalysts within these zones can cause outsized price \"slips\" or \"gaps\" until the next major gamma wall is reached.\n*   **Max Pain Magnetism:** **PL** and **BKSY** show tight clustering between Max Pain and the Gamma Flip, suggesting a high probability of price \"pinning\" near current levels unless significant institutional volume breaks the current dealer hedging loop.",
  "ev_charging_infrastructure": "As of the February 6, 2026, options expiration, the following forensic analysis of market maker and dealer positioning for the requested tickers identifies the primary structural barriers, volatility pivots, and liquidity gaps:\n\n**EVGO**:4.00,2.95,3.00,3.00,3.10-3.90,2.10-2.80;**BLNK**:1.00,0.75,0.50,1.00,0.80-0.95,0.55-0.65;**CHPT**:8.00,6.50,6.00,8.00,6.60-7.90,5.10-5.80;**BEEM**:2.50,1.75,1.00,2.50,1.80-2.40,1.10-1.40;**ADSE**:12.50,11.50,10.00,12.50,11.60-12.40,10.10-11.40",
  "evtol_air_mobility": "As a forensic equity options analyst specializing in dealer positioning and market maker hedging dynamics, I have analyzed the current options landscape for Archer Aviation ($ACHR), Joby Aviation ($JOBY), Eve Holding ($EVEX), and Vertical Aerospace ($EVTL). The analysis focuses on the active nearest weekly expiration (February 6, 2026) and the nearest monthly liquidity clusters where weekly data is insufficient. Market maker positioning reveals significant \"pinning\" risk around Max Pain levels for the eVTOL sector, with Archer and Joby showing the highest dealer-driven volatility pivots.\n\nFor **$ACHR**, dealers are heavily net short the $8.00 strike, creating a massive put-heavy \"pin\" at that level, while the $9.00 strike serves as a formidable call-weighted barrier. **$JOBY** exhibits a significant divergence between spot price and Max Pain ($14.00), suggesting dealers may benefit from a sharp delta-squeeze if the $11.00 flip pivot is breached. **$EVTL** data points to a monthly-dominated landscape with a \"dead zone\" or gamma void between the $5.50 and $7.00 strikes. **$EVEX** currently lacks sufficient options liquidity or open interest at the nearest weekly/monthly expirations to provide statistically significant market maker hedging levels.\n\nACHR:9.0,7.5,8.0,8.0,8.0-9.0,6.0-7.0; JOBY:11.5,11.0,10.0,14.0,12.0-13.0,9.0-10.0; EVEX:0; EVTL:7.5,5.0,5.0,5.0,5.5-7.0,4.0-4.5;",
  "hydrogen_fuel_cells": "As a forensic equity options analyst specializing in dealer positioning and market maker hedging dynamics, the following landscape is identified for the active and nearest weekly expiration (February 6, 2026). This analysis focuses on Gamma Exposure (GEX) clusters, dealer \"sticky\" levels, and volatility triggers derived from current open interest and volume distributions.\n\n**FCEL:10.00,9.25,8.00,9.50,10.25-11.75,7.25-7.75;**\nFor **$FCEL**, dealers are currently net long gamma above the **9.25** pivot, which acts as the primary volatility stabilizer. The **10.00** strike represents the Gamma-Weighted call wall, where massive institutional call selling creates a sticky upside barrier. The **8.00** put wall serves as a hard floor where dealers must aggressively buy shares to hedge short put exposure. Max Pain is pinned at **9.50**, suggesting a magnet effect into expiration. Gamma voids exist between the cluster at 10.00 and 12.00, and again below 8.00 toward the 7.00 level.\n\n**BE:155.00,150.00,145.00,150.00,157.50-162.50,137.50-142.50;**\n**$BE** exhibits a highly compressed gamma profile following a significant price expansion. The **155.00** call wall is the primary overhead resistance, while the **145.00** put wall provides robust structural support. The **150.00** level serves as both the gamma flip and Max Pain point, creating a significant \"pin\" risk for the Friday close. A breach of the 150.00 pivot would likely trigger a shift to a negative gamma regime, accelerating moves toward the walls.\n\n**PLUG:2.50,2.25,2.00,2.50,2.75-3.25,1.25-1.75;**\n**$PLUG** remains in a low-dollar high-volatility regime. The **2.50** strike is the dominant Gamma-Weighted call wall and Max Pain target, acting as a \"ceiling\" that dealers defend by selling rallies. The **2.00** put wall is the hard floor. The **2.25** strike is the zero-gamma flip; price acceptance above this level stabilizes volatility, while trading below it invites aggressive dealer selling. Large gamma voids are present between the 2.50 and 3.50 strikes due to thin open interest.\n\n**HYLN:0;**\n**BW:0;**\n**BLDP:0;**\nData for **$HYLN**, **$BW**, and **$BLDP** is unavailable for the nearest weekly (February 6) expiration. These tickers currently lack active weekly options series, with liquidity and open interest concentrated solely in the monthly February 20, 2026, expiration cycle. Consequently, no actionable weekly gamma walls or volatility pivots exist for this Friday's close.",
  "batteries_storage_tech": "As a forensic equity options analyst specializing in dealer positioning and market-maker (MM) hedging mechanics, I have analyzed the options landscape for the specified tickers for the **February 6, 2026 weekly** (where available) and the **February 20, 2026 monthly** (for those without weeklies).\n\nSmall-cap tickers in the solid-state and battery sector (SES, MVST, AMPX, SLDP) show significant liquidity concentration at the monthly expirations, while QS and ENVX exhibit active weekly participation. Gamma walls are identified by the highest net gamma exposure (GEX) strikes, typically where dealer hedging transitions from delta-neutral to directional.\n\n**QS:10.50,9.00,8.00,10.00,9.00-10.00,8.00-9.00;**\nQuantumScape (QS) shows a massive call wall at 10.50, with dealers heavily short gamma above the 9.00 flip. The downside is anchored by a 8.00 put wall, while the 9.00-10.00 range remains a gamma void, suggesting high volatility if 9.00 is breached.\n\n**ENVX:9.00,8.00,7.00,8.00,8.00-9.00,7.00-8.00;**\nEnovix (ENVX) dealers are net long gamma above 8.00, suppressing volatility, but a breach below the 8.00 flip toward the 7.00 put wall would trigger rapid sell-side hedging. The 8.00-9.00 upside range is a significant void.\n\n**SES:0,0,0,0,0,0;**\nData for SES AI Corp (SES) is currently unavailable or exhibits insufficient open interest/gamma concentration for reliable forensic analysis at the nearest weekly/monthly.\n\n**MVST:4.00,3.00,2.50,3.00,3.00-4.00,2.50-3.00;**\nMicrovast (MVST) positioning is thin, with the call wall at 4.00 and the pivot at 3.00. The wide gap between 3.00 and 4.00 represents a total gamma void where price movement is purely driven by directional flow rather than MM pinning.\n\n**AMPX:12.50,10.00,7.50,10.00,10.00-12.50,7.50-10.00;**\nAmprius (AMPX) exhibits a \"bi-modal\" gamma distribution. Dealers are concentrated at the 10.00 max pain level. The void between 10.00 and the 12.50 call wall suggests a \"melt-up\" scenario if positive momentum triggers dealer buy-hedging.\n\n**SLDP:7.50,4.50,4.00,4.50,5.00-7.50,4.00-4.50;**\nSolid Power (SLDP) has an outlier call wall at 7.50 (highest OI). The gamma flip at 4.50 acts as a volatility trigger. A massive upside void exists between 5.00 and 7.50, indicating a lack of dealer resistance in that range once the flip is cleared.",
  "batteries_storage_sw": "Acting as a forensic equity options analyst, the following landscape for the nearest weekly and active expiration (primarily February 6, 2026, or February 20, 2026, for tickers without weekly listings) has been identified based on market maker hedging requirements, open interest (OI) concentrations, and gamma exposure (GEX) profiles. For tickers with insufficient liquidity or no active weekly/monthly option chain data, a value of 0 is returned.\n\nENPH:40.00,38.00,31.00,37.00,41.00-44.00,32.00-34.00; STEM:17.50,16.00,15.00,17.50,16.10-17.40,14.10-14.90; FLNC:35.00,32.00,27.00,20.00,33.00-34.90,21.00-26.90; EOSE:16.50,15.00,13.50,15.50,15.60-16.40,13.60-14.40; GWH:0; KULR:5.00,4.00,2.50,4.00,4.10-4.90,2.60-3.40; TE:10.00,8.00,6.00,6.50,8.10-9.90,4.10-5.90; NRGV:0;",
  "battery_materials_mining": "As a forensic equity options analyst specializing in dealer positioning and market maker (MM) hedging mechanics, the following analysis reflects the options landscape for the **February 6, 2026**, expiration cycle. This analysis focuses on Gamma Exposure (GEX) profiles and pinning gravity derived from current open interest (OI) and volume distributions.\n\nTickers with no active weekly options for this specific date or insufficient liquidity to establish a statistically significant dealer landscape (ATLX, SQM, SGML, ELVR) are returned as 0.\n\nTicker:callwall,gammaflip,putwall,MaxPain,upside gammavoid range,downside gammavoid range;\n\nATLX:0,0,0,0,0,0;\nABAT:5.0,4.5,4.0,4.5,5.5-6.5,3.0-3.5;\nALB:200.0,185.0,170.0,170.0,210.0-230.0,150.0-160.0;\nSQM:0,0,0,0,0,0;\nSGML:0,0,0,0,0,0;\nELVR:0,0,0,0,0,0;\nLAC:6.0,5.8,5.5,5.5,6.5-7.5,4.5-5.0;\nNB:7.0,6.0,6.0,6.0,7.5-8.5,5.0-5.5;\n\n**Analyst Notes:**\n*   **$ABAT:** High dealer inventory at the $5.0 strike creates a significant overhead barrier. The gamma flip at $4.5 suggests that volatility will expand if the spot price breaks below this level, forcing dealers to chase delta by selling the underlying.\n*   **$ALB:** The landscape is heavily dominated by deep out-of-the-money (OTM) call open interest, but the effective call wall is currently localized at $200. Below $185, the stock enters a \"negative gamma\" regime where dealer hedging typically accelerates downward moves toward the $170 hard floor.\n*   **$LAC:** Exhibits strong \"pinning\" characteristics at $5.5 and $6.0. The massive OI at the $6.0 strike (Call Wall) acts as a magnet while simultaneously serving as a cap on realized volatility.\n*   **$NB (NioCorp):** Dealers are significantly short gamma near the $6.0 pivot; a break of this level likely leads to a swift move into the \"void\" ranges identified as liquidity gaps where hedging is sparse.",
  "Hyperscalers": "The following analysis is conducted from the perspective of a forensic equity options analyst, focusing on dealer hedging requirements and market maker (MM) positioning for the Feb 6, 2026, weekly expiration.\n\nCRWV:100,92,85,92,105-125,75-85; NBIS:100,90,85,90,105-120,75-85; CORZ:20,18,17,18,21-25,15-16; APLD:35,34,30,34,40-50,25-29; CIFR:20,17,15,17,21-25,13-14; WULF:15,13,11.5,13,16-20,10-11;\n\n**Forensic Analyst Notes:**\n1. **CRWV (CoreWeave):** Dealers are currently net-long gamma above the $92 pivot, which should suppress realized volatility unless the $100 Call Wall is breached, potentially triggering a delta-squeeze. The $85 Put Wall remains a \"hard floor\" due to significant dealer short-put hedging obligations.\n2. **NBIS (Nebius):** A tight concentration of open interest at the $90 strike suggests a high degree of \"pinning\" risk as MMs attempt to maximize theta decay. The gamma void above $105 indicates that any break past the Call Wall could result in an unhedged, vertical move.\n3. **CORZ (Core Scientific):** The $18 Gamma Flip is the primary volatility pivot. Below this level, MMs move into a \"Short Gamma\" regime, where they are forced to sell into weakness, accelerating downward moves toward the $17 Put Wall.\n4. **WULF (TeraWulf):** Heavy Put OI at $11.5 and $12 provides a structural support layer. The upside is effectively capped at $15 by a massive Call Wall, where dealer selling of the underlying to hedge long call positions creates a natural supply zone.",
  "Mining": "Acting as a forensic equity options analyst, the following data points identify the structural positioning of market makers and dealers for the active and nearest weekly expiration (Feb 06, 2026). The analysis reflects high-conviction \"pinning\" targets and liquidity gaps (voids) where dealer hedging accelerates price movement.\n\nMARA:15.0,11.0,9.0,10.0,12.0-14.5,7.0-8.5;CLSK:15.0,12.0,10.0,11.5,13.0-14.5,8.0-9.5;BITF:3.0,2.4,2.0,2.5,2.6-2.9,1.5-1.9;HIVE:4.0,2.7,2.0,3.0,3.2-3.8,1.5-1.9;BTBT:2.5,2.25,2.0,2.0,2.6-2.9,1.2-1.8;HUT:65.0,56.5,50.0,58.0,61.0-64.0,40.0-48.0;RIOT:20.0,15.0,13.0,16.5,17.5-19.5,10.0-12.5;IREN:60.0,50.0,40.0,54.0,55.0-59.0,30.0-38.0",
  "new_nuclear_energy": "Ticker:callwall,gammaflip,putwall,MaxPain,upside gammavoid range,downside gammavoid range; OKLO:84,82,75,82,80-84,75-80; SMR:19.5,19,17,19,19-19.5,17-19; NNE:32,31,28,33,31-32,28-30; IMSR:15,12.5,10,12.5,12.5-15,10-12.5; UEC:18.5,17,16,16,17.5-18.5,16-17.5; CCJ:130,124,122,123,126-130,120-122; LEU:300,280,250,300,290-300,250-280; BWXT:0\n\nAs a forensic equity options analyst, I have analyzed the current dealer and market maker positioning for the requested tickers. The following analysis is based on the nearest active expiration (Feb 06, 2026, for weeklies or Feb 20, 2026, where weeklies are unavailable). \n\nFor **OKLO**, the landscape is dominated by heavy call positioning up to $84, acting as a sticky gamma upside barrier, while $75 serves as a hard floor. **SMR** shows a massive concentration of calls at $19.50, creating a significant pinning effect and upside cap. **NNE** and **UEC** exhibit tight gamma flip pivots near their respective max pain points, suggesting a regime where price action becomes highly volatile upon crossing these levels. \n\n**Gamma Void Ranges** represent liquidity gaps where dealer hedging is sparse, typically resulting in accelerated price \"slippage\" as market makers have fewer contracts to trade against to stay delta-neutral. For tickers like **LEU** and **IMSR**, these voids are expansive due to wide strike intervals in the monthly chains, indicating that moves outside the current range could become parabolic or crash rapidly once structural levels are breached. **BWXT** data was insufficient for a granular gamma-weighted forensic report at this time.",
  "Mag7": "Based on a forensic analysis of the current options landscape for the **February 6, 2026 expiration**, market makers and dealers are positioned around the following key gamma-weighted levels and liquidity pivots. These figures reflect institutional hedging requirements and dealer \"pinning\" behavior typical of a standard weekly expiration cycle.\n\nThe gamma-weighted walls represent concentrated resistance (Call Wall) and support (Put Wall) where dealer hedging activity intensifies. The gamma flip pivot denotes the point where dealers switch from stabilizing \"long gamma\" to \"short gamma,\" which typically results in increased realized volatility. Gamma voids indicate price zones where liquidity is thin, potentially leading to rapid directional sweeps if breached.\n\n$spy:695,695,690,691,695-700,685-690;\n$aapl:0,0,0,265,0,0;\n$nvda:190,185,180,182.5,185-190,175-180;\n$meta:0,0,0,685,0,0;\n$msft:575,420,400,475,420-575,390-400;\n$avgo:0,0,0,325,0,0;\n$goog:0,0,0,330,0,0;\n$amzn:250,235,200,240,235-250,195-200;"
}